Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK0)  Position */
#define FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0_Pos) /* (FUSES_KEYVAL_INTCHK0)  Mask */
#define FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0(value) (FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK0_KEYVAL_INTCHK0_Pos)) /* Assignment of value for KEYVAL_INTCHK0 in the FUSES_KEYVAL_INTCHK0 register */
#define FUSES_KEYVAL_INTCHK0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK0) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK1 : (FUSES Offset: 0x424) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK1)  Position */
#define FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1_Pos) /* (FUSES_KEYVAL_INTCHK1)  Mask */
#define FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1(value) (FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK1_KEYVAL_INTCHK1_Pos)) /* Assignment of value for KEYVAL_INTCHK1 in the FUSES_KEYVAL_INTCHK1 register */
#define FUSES_KEYVAL_INTCHK1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK1) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK2 : (FUSES Offset: 0x428) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK2)  Position */
#define FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2_Pos) /* (FUSES_KEYVAL_INTCHK2)  Mask */
#define FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2(value) (FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK2_KEYVAL_INTCHK2_Pos)) /* Assignment of value for KEYVAL_INTCHK2 in the FUSES_KEYVAL_INTCHK2 register */
#define FUSES_KEYVAL_INTCHK2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK2) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK3 : (FUSES Offset: 0x42C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK3)  Position */
#define FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3_Pos) /* (FUSES_KEYVAL_INTCHK3)  Mask */
#define FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3(value) (FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK3_KEYVAL_INTCHK3_Pos)) /* Assignment of value for KEYVAL_INTCHK3 in the FUSES_KEYVAL_INTCHK3 register */
#define FUSES_KEYVAL_INTCHK3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK3) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK4 : (FUSES Offset: 0x430) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK4)  Position */
#define FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4_Pos) /* (FUSES_KEYVAL_INTCHK4)  Mask */
#define FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4(value) (FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK4_KEYVAL_INTCHK4_Pos)) /* Assignment of value for KEYVAL_INTCHK4 in the FUSES_KEYVAL_INTCHK4 register */
#define FUSES_KEYVAL_INTCHK4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK4) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK5 : (FUSES Offset: 0x434) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK5)  Position */
#define FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5_Pos) /* (FUSES_KEYVAL_INTCHK5)  Mask */
#define FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5(value) (FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK5_KEYVAL_INTCHK5_Pos)) /* Assignment of value for KEYVAL_INTCHK5 in the FUSES_KEYVAL_INTCHK5 register */
#define FUSES_KEYVAL_INTCHK5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK5) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK6 : (FUSES Offset: 0x438) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK6)  Position */
#define FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6_Pos) /* (FUSES_KEYVAL_INTCHK6)  Mask */
#define FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6(value) (FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK6_KEYVAL_INTCHK6_Pos)) /* Assignment of value for KEYVAL_INTCHK6 in the FUSES_KEYVAL_INTCHK6 register */
#define FUSES_KEYVAL_INTCHK6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK6) Register Mask  */


/* -------- FUSES_KEYVAL_INTCHK7 : (FUSES Offset: 0x43C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_INTCHK7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_INTCHK7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_INTCHK7)  Position */
#define FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7_Pos) /* (FUSES_KEYVAL_INTCHK7)  Mask */
#define FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7(value) (FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7_Msk & (_UINT32_(value) << FUSES_KEYVAL_INTCHK7_KEYVAL_INTCHK7_Pos)) /* Assignment of value for KEYVAL_INTCHK7 in the FUSES_KEYVAL_INTCHK7 register */
#define FUSES_KEYVAL_INTCHK7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_INTCHK7) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL0 : (FUSES Offset: 0x440) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_ALL0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL0) Mapped Fuse Register  Reset Value */

