Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S5)  Position */
#define FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5_Pos) /* (FUSES_KEYVAL_CE_S5)  Mask */
#define FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5(value) (FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S5_KEYVAL_CE_S5_Pos)) /* Assignment of value for KEYVAL_CE_S5 in the FUSES_KEYVAL_CE_S5 register */
#define FUSES_KEYVAL_CE_S5_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S5) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S6 : (FUSES Offset: 0x498) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S6_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S6)  Position */
#define FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6_Pos) /* (FUSES_KEYVAL_CE_S6)  Mask */
#define FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6(value) (FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S6_KEYVAL_CE_S6_Pos)) /* Assignment of value for KEYVAL_CE_S6 in the FUSES_KEYVAL_CE_S6 register */
#define FUSES_KEYVAL_CE_S6_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S6) Register Mask  */


/* -------- FUSES_KEYVAL_CE_S7 : (FUSES Offset: 0x49C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_S7_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_S7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7_Pos   _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_S7)  Position */
#define FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7_Msk   (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7_Pos) /* (FUSES_KEYVAL_CE_S7)  Mask */
#define FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7(value) (FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_S7_KEYVAL_CE_S7_Pos)) /* Assignment of value for KEYVAL_CE_S7 in the FUSES_KEYVAL_CE_S7 register */
#define FUSES_KEYVAL_CE_S7_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_S7) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR0 : (FUSES Offset: 0x4A0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR0_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR0)  Position */
#define FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0_Pos) /* (FUSES_KEYVAL_CE_NS_CR0)  Mask */
#define FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0(value) (FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR0_KEYVAL_CE_NS_CR0_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR0 in the FUSES_KEYVAL_CE_NS_CR0 register */
#define FUSES_KEYVAL_CE_NS_CR0_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR0) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR1 : (FUSES Offset: 0x4A4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR1_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR1)  Position */
#define FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1_Pos) /* (FUSES_KEYVAL_CE_NS_CR1)  Mask */
#define FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1(value) (FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR1_KEYVAL_CE_NS_CR1_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR1 in the FUSES_KEYVAL_CE_NS_CR1 register */
#define FUSES_KEYVAL_CE_NS_CR1_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR1) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR2 : (FUSES Offset: 0x4A8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR2_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR2)  Position */
#define FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2_Pos) /* (FUSES_KEYVAL_CE_NS_CR2)  Mask */
#define FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2(value) (FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR2_KEYVAL_CE_NS_CR2_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR2 in the FUSES_KEYVAL_CE_NS_CR2 register */
#define FUSES_KEYVAL_CE_NS_CR2_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR2) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR3 : (FUSES Offset: 0x4AC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR3_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR3)  Position */
#define FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3_Pos) /* (FUSES_KEYVAL_CE_NS_CR3)  Mask */
#define FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3(value) (FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR3_KEYVAL_CE_NS_CR3_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR3 in the FUSES_KEYVAL_CE_NS_CR3 register */
#define FUSES_KEYVAL_CE_NS_CR3_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR3) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR4 : (FUSES Offset: 0x4B0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR4_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR4) Mapped Fuse Register  Reset Value */

