Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR4)  Position */
#define FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4_Pos) /* (FUSES_KEYVAL_CE_NS_CR4)  Mask */
#define FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4(value) (FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR4_KEYVAL_CE_NS_CR4_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR4 in the FUSES_KEYVAL_CE_NS_CR4 register */
#define FUSES_KEYVAL_CE_NS_CR4_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR4) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR5 : (FUSES Offset: 0x4B4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR5_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR5)  Position */
#define FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5_Pos) /* (FUSES_KEYVAL_CE_NS_CR5)  Mask */
#define FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5(value) (FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR5_KEYVAL_CE_NS_CR5_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR5 in the FUSES_KEYVAL_CE_NS_CR5 register */
#define FUSES_KEYVAL_CE_NS_CR5_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR5) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR6 : (FUSES Offset: 0x4B8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR6_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR6)  Position */
#define FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6_Pos) /* (FUSES_KEYVAL_CE_NS_CR6)  Mask */
#define FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6(value) (FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR6_KEYVAL_CE_NS_CR6_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR6 in the FUSES_KEYVAL_CE_NS_CR6 register */
#define FUSES_KEYVAL_CE_NS_CR6_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR6) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS_CR7 : (FUSES Offset: 0x4BC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS_CR7_RESETVALUE     _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS_CR7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS_CR7)  Position */
#define FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7_Pos) /* (FUSES_KEYVAL_CE_NS_CR7)  Mask */
#define FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7(value) (FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS_CR7_KEYVAL_CE_NS_CR7_Pos)) /* Assignment of value for KEYVAL_CE_NS_CR7 in the FUSES_KEYVAL_CE_NS_CR7 register */
#define FUSES_KEYVAL_CE_NS_CR7_Msk            _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS_CR7) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS0 : (FUSES Offset: 0x4C0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS0_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS0)  Position */
#define FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0_Pos) /* (FUSES_KEYVAL_CE_NS0)  Mask */
#define FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0(value) (FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS0_KEYVAL_CE_NS0_Pos)) /* Assignment of value for KEYVAL_CE_NS0 in the FUSES_KEYVAL_CE_NS0 register */
#define FUSES_KEYVAL_CE_NS0_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS0) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS1 : (FUSES Offset: 0x4C4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS1_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS1)  Position */
#define FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1_Pos) /* (FUSES_KEYVAL_CE_NS1)  Mask */
#define FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1(value) (FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS1_KEYVAL_CE_NS1_Pos)) /* Assignment of value for KEYVAL_CE_NS1 in the FUSES_KEYVAL_CE_NS1 register */
#define FUSES_KEYVAL_CE_NS1_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS1) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS2 : (FUSES Offset: 0x4C8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS2_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS2)  Position */
#define FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2_Pos) /* (FUSES_KEYVAL_CE_NS2)  Mask */
#define FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2(value) (FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS2_KEYVAL_CE_NS2_Pos)) /* Assignment of value for KEYVAL_CE_NS2 in the FUSES_KEYVAL_CE_NS2 register */
#define FUSES_KEYVAL_CE_NS2_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS2) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS3 : (FUSES Offset: 0x4CC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS3_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS3)  Position */
#define FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3_Pos) /* (FUSES_KEYVAL_CE_NS3)  Mask */
#define FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3(value) (FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS3_KEYVAL_CE_NS3_Pos)) /* Assignment of value for KEYVAL_CE_NS3 in the FUSES_KEYVAL_CE_NS3 register */
#define FUSES_KEYVAL_CE_NS3_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS3) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS4 : (FUSES Offset: 0x4D0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS4_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS4)  Position */
#define FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4_Pos) /* (FUSES_KEYVAL_CE_NS4)  Mask */
#define FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4(value) (FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS4_KEYVAL_CE_NS4_Pos)) /* Assignment of value for KEYVAL_CE_NS4 in the FUSES_KEYVAL_CE_NS4 register */
#define FUSES_KEYVAL_CE_NS4_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS4) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS5 : (FUSES Offset: 0x4D4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS5_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS5)  Position */
#define FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5_Pos) /* (FUSES_KEYVAL_CE_NS5)  Mask */
#define FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5(value) (FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS5_KEYVAL_CE_NS5_Pos)) /* Assignment of value for KEYVAL_CE_NS5 in the FUSES_KEYVAL_CE_NS5 register */
#define FUSES_KEYVAL_CE_NS5_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS5) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS6 : (FUSES Offset: 0x4D8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS6_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS6) Mapped Fuse Register  Reset Value */

