Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS6)  Position */
#define FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6_Pos) /* (FUSES_KEYVAL_CE_NS6)  Mask */
#define FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6(value) (FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS6_KEYVAL_CE_NS6_Pos)) /* Assignment of value for KEYVAL_CE_NS6 in the FUSES_KEYVAL_CE_NS6 register */
#define FUSES_KEYVAL_CE_NS6_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS6) Register Mask  */


/* -------- FUSES_KEYVAL_CE_NS7 : (FUSES Offset: 0x4DC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_CE_NS7_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_NS7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_NS7)  Position */
#define FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7_Pos) /* (FUSES_KEYVAL_CE_NS7)  Mask */
#define FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7(value) (FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_NS7_KEYVAL_CE_NS7_Pos)) /* Assignment of value for KEYVAL_CE_NS7 in the FUSES_KEYVAL_CE_NS7 register */
#define FUSES_KEYVAL_CE_NS7_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_NS7) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG0 : (FUSES Offset: 0x4E0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG0)  Position */
#define FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0_Pos) /* (FUSES_KEYVAL_PRG_PG0)  Mask */
#define FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0(value) (FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG0_KEYVAL_PRG_PG0_Pos)) /* Assignment of value for KEYVAL_PRG_PG0 in the FUSES_KEYVAL_PRG_PG0 register */
#define FUSES_KEYVAL_PRG_PG0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG0) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG1 : (FUSES Offset: 0x4E4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG1)  Position */
#define FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1_Pos) /* (FUSES_KEYVAL_PRG_PG1)  Mask */
#define FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1(value) (FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG1_KEYVAL_PRG_PG1_Pos)) /* Assignment of value for KEYVAL_PRG_PG1 in the FUSES_KEYVAL_PRG_PG1 register */
#define FUSES_KEYVAL_PRG_PG1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG1) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG2 : (FUSES Offset: 0x4E8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG2)  Position */
#define FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2_Pos) /* (FUSES_KEYVAL_PRG_PG2)  Mask */
#define FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2(value) (FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG2_KEYVAL_PRG_PG2_Pos)) /* Assignment of value for KEYVAL_PRG_PG2 in the FUSES_KEYVAL_PRG_PG2 register */
#define FUSES_KEYVAL_PRG_PG2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG2) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG3 : (FUSES Offset: 0x4EC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG3)  Position */
#define FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3_Pos) /* (FUSES_KEYVAL_PRG_PG3)  Mask */
#define FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3(value) (FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG3_KEYVAL_PRG_PG3_Pos)) /* Assignment of value for KEYVAL_PRG_PG3 in the FUSES_KEYVAL_PRG_PG3 register */
#define FUSES_KEYVAL_PRG_PG3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG3) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG4 : (FUSES Offset: 0x4F0) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG4)  Position */
#define FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4_Pos) /* (FUSES_KEYVAL_PRG_PG4)  Mask */
#define FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4(value) (FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG4_KEYVAL_PRG_PG4_Pos)) /* Assignment of value for KEYVAL_PRG_PG4 in the FUSES_KEYVAL_PRG_PG4 register */
#define FUSES_KEYVAL_PRG_PG4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG4) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG5 : (FUSES Offset: 0x4F4) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG5)  Position */
#define FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5_Pos) /* (FUSES_KEYVAL_PRG_PG5)  Mask */
#define FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5(value) (FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG5_KEYVAL_PRG_PG5_Pos)) /* Assignment of value for KEYVAL_PRG_PG5 in the FUSES_KEYVAL_PRG_PG5 register */
#define FUSES_KEYVAL_PRG_PG5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG5) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG6 : (FUSES Offset: 0x4F8) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG6)  Position */
#define FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6_Pos) /* (FUSES_KEYVAL_PRG_PG6)  Mask */
#define FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6(value) (FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG6_KEYVAL_PRG_PG6_Pos)) /* Assignment of value for KEYVAL_PRG_PG6 in the FUSES_KEYVAL_PRG_PG6 register */
#define FUSES_KEYVAL_PRG_PG6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG6) Register Mask  */


/* -------- FUSES_KEYVAL_PRG_PG7 : (FUSES Offset: 0x4FC) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_PRG_PG7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_PRG_PG7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_PRG_PG7)  Position */
#define FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7_Pos) /* (FUSES_KEYVAL_PRG_PG7)  Mask */
#define FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7(value) (FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7_Msk & (_UINT32_(value) << FUSES_KEYVAL_PRG_PG7_KEYVAL_PRG_PG7_Pos)) /* Assignment of value for KEYVAL_PRG_PG7 in the FUSES_KEYVAL_PRG_PG7 register */
#define FUSES_KEYVAL_PRG_PG7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_PRG_PG7) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_0 : (FUSES Offset: 0x500) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_0)  Position */
#define FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0_Pos) /* (FUSES_KEYVAL_SDAL1_0)  Mask */
#define FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0(value) (FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_0_KEYVAL_SDAL1_0_Pos)) /* Assignment of value for KEYVAL_SDAL1_0 in the FUSES_KEYVAL_SDAL1_0 register */
#define FUSES_KEYVAL_SDAL1_0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_0) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_1 : (FUSES Offset: 0x504) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_1)  Position */
#define FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1_Pos) /* (FUSES_KEYVAL_SDAL1_1)  Mask */
#define FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1(value) (FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_1_KEYVAL_SDAL1_1_Pos)) /* Assignment of value for KEYVAL_SDAL1_1 in the FUSES_KEYVAL_SDAL1_1 register */
#define FUSES_KEYVAL_SDAL1_1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_1) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_2 : (FUSES Offset: 0x508) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_2)  Position */
#define FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2_Pos) /* (FUSES_KEYVAL_SDAL1_2)  Mask */
#define FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2(value) (FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_2_KEYVAL_SDAL1_2_Pos)) /* Assignment of value for KEYVAL_SDAL1_2 in the FUSES_KEYVAL_SDAL1_2 register */
#define FUSES_KEYVAL_SDAL1_2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_2) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_3 : (FUSES Offset: 0x50C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_3) Mapped Fuse Register  Reset Value */

