Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_3)  Position */
#define FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3_Pos) /* (FUSES_KEYVAL_SDAL1_3)  Mask */
#define FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3(value) (FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_3_KEYVAL_SDAL1_3_Pos)) /* Assignment of value for KEYVAL_SDAL1_3 in the FUSES_KEYVAL_SDAL1_3 register */
#define FUSES_KEYVAL_SDAL1_3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_3) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_4 : (FUSES Offset: 0x510) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_4)  Position */
#define FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4_Pos) /* (FUSES_KEYVAL_SDAL1_4)  Mask */
#define FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4(value) (FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_4_KEYVAL_SDAL1_4_Pos)) /* Assignment of value for KEYVAL_SDAL1_4 in the FUSES_KEYVAL_SDAL1_4 register */
#define FUSES_KEYVAL_SDAL1_4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_4) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_5 : (FUSES Offset: 0x514) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_5)  Position */
#define FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5_Pos) /* (FUSES_KEYVAL_SDAL1_5)  Mask */
#define FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5(value) (FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_5_KEYVAL_SDAL1_5_Pos)) /* Assignment of value for KEYVAL_SDAL1_5 in the FUSES_KEYVAL_SDAL1_5 register */
#define FUSES_KEYVAL_SDAL1_5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_5) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_6 : (FUSES Offset: 0x518) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_6)  Position */
#define FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6_Pos) /* (FUSES_KEYVAL_SDAL1_6)  Mask */
#define FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6(value) (FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_6_KEYVAL_SDAL1_6_Pos)) /* Assignment of value for KEYVAL_SDAL1_6 in the FUSES_KEYVAL_SDAL1_6 register */
#define FUSES_KEYVAL_SDAL1_6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_6) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL1_7 : (FUSES Offset: 0x51C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL1_7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL1_7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL1_7)  Position */
#define FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7_Pos) /* (FUSES_KEYVAL_SDAL1_7)  Mask */
#define FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7(value) (FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL1_7_KEYVAL_SDAL1_7_Pos)) /* Assignment of value for KEYVAL_SDAL1_7 in the FUSES_KEYVAL_SDAL1_7 register */
#define FUSES_KEYVAL_SDAL1_7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL1_7) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_0 : (FUSES Offset: 0x520) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_0)  Position */
#define FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0_Pos) /* (FUSES_KEYVAL_SDAL0_0)  Mask */
#define FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0(value) (FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_0_KEYVAL_SDAL0_0_Pos)) /* Assignment of value for KEYVAL_SDAL0_0 in the FUSES_KEYVAL_SDAL0_0 register */
#define FUSES_KEYVAL_SDAL0_0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_0) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_1 : (FUSES Offset: 0x524) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_1)  Position */
#define FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1_Pos) /* (FUSES_KEYVAL_SDAL0_1)  Mask */
#define FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1(value) (FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_1_KEYVAL_SDAL0_1_Pos)) /* Assignment of value for KEYVAL_SDAL0_1 in the FUSES_KEYVAL_SDAL0_1 register */
#define FUSES_KEYVAL_SDAL0_1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_1) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_2 : (FUSES Offset: 0x528) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_2)  Position */
#define FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2_Pos) /* (FUSES_KEYVAL_SDAL0_2)  Mask */
#define FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2(value) (FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_2_KEYVAL_SDAL0_2_Pos)) /* Assignment of value for KEYVAL_SDAL0_2 in the FUSES_KEYVAL_SDAL0_2 register */
#define FUSES_KEYVAL_SDAL0_2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_2) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_3 : (FUSES Offset: 0x52C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_3)  Position */
#define FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3_Pos) /* (FUSES_KEYVAL_SDAL0_3)  Mask */
#define FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3(value) (FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_3_KEYVAL_SDAL0_3_Pos)) /* Assignment of value for KEYVAL_SDAL0_3 in the FUSES_KEYVAL_SDAL0_3 register */
#define FUSES_KEYVAL_SDAL0_3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_3) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_4 : (FUSES Offset: 0x530) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_4) Mapped Fuse Register  Reset Value */

