Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_4)  Position */
#define FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4_Pos) /* (FUSES_KEYVAL_SDAL0_4)  Mask */
#define FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4(value) (FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_4_KEYVAL_SDAL0_4_Pos)) /* Assignment of value for KEYVAL_SDAL0_4 in the FUSES_KEYVAL_SDAL0_4 register */
#define FUSES_KEYVAL_SDAL0_4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_4) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_5 : (FUSES Offset: 0x534) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_5)  Position */
#define FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5_Pos) /* (FUSES_KEYVAL_SDAL0_5)  Mask */
#define FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5(value) (FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_5_KEYVAL_SDAL0_5_Pos)) /* Assignment of value for KEYVAL_SDAL0_5 in the FUSES_KEYVAL_SDAL0_5 register */
#define FUSES_KEYVAL_SDAL0_5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_5) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_6 : (FUSES Offset: 0x538) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_6)  Position */
#define FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6_Pos) /* (FUSES_KEYVAL_SDAL0_6)  Mask */
#define FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6(value) (FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_6_KEYVAL_SDAL0_6_Pos)) /* Assignment of value for KEYVAL_SDAL0_6 in the FUSES_KEYVAL_SDAL0_6 register */
#define FUSES_KEYVAL_SDAL0_6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_6) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0_7 : (FUSES Offset: 0x53C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_SDAL0_7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0_7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0_7)  Position */
#define FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7_Pos) /* (FUSES_KEYVAL_SDAL0_7)  Mask */
#define FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7(value) (FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_7_KEYVAL_SDAL0_7_Pos)) /* Assignment of value for KEYVAL_SDAL0_7 in the FUSES_KEYVAL_SDAL0_7 register */
#define FUSES_KEYVAL_SDAL0_7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0_7) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL0 : (FUSES Offset: 0x540) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL0_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL0) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL0)  Position */
#define FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0_Pos) /* (FUSES_KEYVAL_DAL_EL0)  Mask */
#define FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0(value) (FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL0_KEYVAL_DAL_EL0_Pos)) /* Assignment of value for KEYVAL_DAL_EL0 in the FUSES_KEYVAL_DAL_EL0 register */
#define FUSES_KEYVAL_DAL_EL0_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL0) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL1 : (FUSES Offset: 0x544) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL1_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL1) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL1)  Position */
#define FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1_Pos) /* (FUSES_KEYVAL_DAL_EL1)  Mask */
#define FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1(value) (FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL1_KEYVAL_DAL_EL1_Pos)) /* Assignment of value for KEYVAL_DAL_EL1 in the FUSES_KEYVAL_DAL_EL1 register */
#define FUSES_KEYVAL_DAL_EL1_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL1) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL2 : (FUSES Offset: 0x548) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL2_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL2) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL2)  Position */
#define FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2_Pos) /* (FUSES_KEYVAL_DAL_EL2)  Mask */
#define FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2(value) (FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL2_KEYVAL_DAL_EL2_Pos)) /* Assignment of value for KEYVAL_DAL_EL2 in the FUSES_KEYVAL_DAL_EL2 register */
#define FUSES_KEYVAL_DAL_EL2_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL2) Register Mask  */


