Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* -------- FUSES_KEYVAL_DAL_EL3 : (FUSES Offset: 0x54C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL3_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL3) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL3)  Position */
#define FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3_Pos) /* (FUSES_KEYVAL_DAL_EL3)  Mask */
#define FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3(value) (FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL3_KEYVAL_DAL_EL3_Pos)) /* Assignment of value for KEYVAL_DAL_EL3 in the FUSES_KEYVAL_DAL_EL3 register */
#define FUSES_KEYVAL_DAL_EL3_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL3) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL4 : (FUSES Offset: 0x550) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL4_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL4) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL4)  Position */
#define FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4_Pos) /* (FUSES_KEYVAL_DAL_EL4)  Mask */
#define FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4(value) (FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL4_KEYVAL_DAL_EL4_Pos)) /* Assignment of value for KEYVAL_DAL_EL4 in the FUSES_KEYVAL_DAL_EL4 register */
#define FUSES_KEYVAL_DAL_EL4_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL4) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL5 : (FUSES Offset: 0x554) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL5_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL5) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL5)  Position */
#define FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5_Pos) /* (FUSES_KEYVAL_DAL_EL5)  Mask */
#define FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5(value) (FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL5_KEYVAL_DAL_EL5_Pos)) /* Assignment of value for KEYVAL_DAL_EL5 in the FUSES_KEYVAL_DAL_EL5 register */
#define FUSES_KEYVAL_DAL_EL5_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL5) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL6 : (FUSES Offset: 0x558) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL6_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL6) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL6)  Position */
#define FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6_Pos) /* (FUSES_KEYVAL_DAL_EL6)  Mask */
#define FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6(value) (FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL6_KEYVAL_DAL_EL6_Pos)) /* Assignment of value for KEYVAL_DAL_EL6 in the FUSES_KEYVAL_DAL_EL6 register */
#define FUSES_KEYVAL_DAL_EL6_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL6) Register Mask  */


/* -------- FUSES_KEYVAL_DAL_EL7 : (FUSES Offset: 0x55C) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_KEYVAL_DAL_EL7_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_DAL_EL7) Mapped Fuse Register  Reset Value */

#define FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7_Pos _UINT32_(0)                                          /* (FUSES_KEYVAL_DAL_EL7)  Position */
#define FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7_Pos) /* (FUSES_KEYVAL_DAL_EL7)  Mask */
#define FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7(value) (FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7_Msk & (_UINT32_(value) << FUSES_KEYVAL_DAL_EL7_KEYVAL_DAL_EL7_Pos)) /* Assignment of value for KEYVAL_DAL_EL7 in the FUSES_KEYVAL_DAL_EL7 register */
#define FUSES_KEYVAL_DAL_EL7_Msk              _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_DAL_EL7) Register Mask  */


/* -------- FUSES_PUF_AC : (FUSES Offset: 0xC00) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_PUF_AC_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_PUF_AC) Mapped Fuse Register  Reset Value */

#define FUSES_PUF_AC_PUF_AC_Pos               _UINT32_(0)                                          /* (FUSES_PUF_AC)  Position */
#define FUSES_PUF_AC_PUF_AC_Msk               (_UINT32_(0xFFFFFFFF) << FUSES_PUF_AC_PUF_AC_Pos)    /* (FUSES_PUF_AC)  Mask */
#define FUSES_PUF_AC_PUF_AC(value)            (FUSES_PUF_AC_PUF_AC_Msk & (_UINT32_(value) << FUSES_PUF_AC_PUF_AC_Pos)) /* Assignment of value for PUF_AC in the FUSES_PUF_AC register */
#define FUSES_PUF_AC_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_PUF_AC) Register Mask  */


/* -------- FUSES_DEVSIGN : (FUSES Offset: 0x0C) (R/W 32) DEVSIGN -------- */
#define FUSES_DEVSIGN_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_DEVSIGN) DEVSIGN  Reset Value */

#define FUSES_DEVSIGN_SEQ_Pos                 _UINT32_(0)                                          /* (FUSES_DEVSIGN) Sequence number Position */
#define FUSES_DEVSIGN_SEQ_Msk                 (_UINT32_(0xFFFF) << FUSES_DEVSIGN_SEQ_Pos)          /* (FUSES_DEVSIGN) Sequence number Mask */
#define FUSES_DEVSIGN_SEQ(value)              (FUSES_DEVSIGN_SEQ_Msk & (_UINT32_(value) << FUSES_DEVSIGN_SEQ_Pos)) /* Assignment of value for SEQ in the FUSES_DEVSIGN register */
#define FUSES_DEVSIGN_SEQBAR_Pos              _UINT32_(16)                                         /* (FUSES_DEVSIGN) Sequence number BAR Position */
#define FUSES_DEVSIGN_SEQBAR_Msk              (_UINT32_(0xFFFF) << FUSES_DEVSIGN_SEQBAR_Pos)       /* (FUSES_DEVSIGN) Sequence number BAR Mask */
#define FUSES_DEVSIGN_SEQBAR(value)           (FUSES_DEVSIGN_SEQBAR_Msk & (_UINT32_(value) << FUSES_DEVSIGN_SEQBAR_Pos)) /* Assignment of value for SEQBAR in the FUSES_DEVSIGN register */
#define FUSES_DEVSIGN_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_DEVSIGN) Register Mask  */


/* -------- FUSES_BOOT_FLAG : (FUSES Offset: 0x800) (R/W 32) BOOT CODE FLAGS REGISTER -------- */
#define FUSES_BOOT_FLAG_RESETVALUE            _UINT32_(0xFFFFFFF9)                                 /*  (FUSES_BOOT_FLAG) BOOT CODE FLAGS REGISTER  Reset Value */

#define FUSES_BOOT_FLAG_PUFRETRY_Pos          _UINT32_(1)                                          /* (FUSES_BOOT_FLAG) PUF Retry Position */
#define FUSES_BOOT_FLAG_PUFRETRY_Msk          (_UINT32_(0x1) << FUSES_BOOT_FLAG_PUFRETRY_Pos)      /* (FUSES_BOOT_FLAG) PUF Retry Mask */
#define FUSES_BOOT_FLAG_PUFRETRY(value)       (FUSES_BOOT_FLAG_PUFRETRY_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_PUFRETRY_Pos)) /* Assignment of value for PUFRETRY in the FUSES_BOOT_FLAG register */
#define FUSES_BOOT_FLAG_PUFSTARTUP_Pos        _UINT32_(2)                                          /* (FUSES_BOOT_FLAG) PUF Start Up Mode Position */
#define FUSES_BOOT_FLAG_PUFSTARTUP_Msk        (_UINT32_(0x1) << FUSES_BOOT_FLAG_PUFSTARTUP_Pos)    /* (FUSES_BOOT_FLAG) PUF Start Up Mode Mask */
#define FUSES_BOOT_FLAG_PUFSTARTUP(value)     (FUSES_BOOT_FLAG_PUFSTARTUP_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_PUFSTARTUP_Pos)) /* Assignment of value for PUFSTARTUP in the FUSES_BOOT_FLAG register */
#define FUSES_BOOT_FLAG_DICEDIS_Pos           _UINT32_(3)                                          /* (FUSES_BOOT_FLAG) Device Identifier Composition Engine Disable Position */
#define FUSES_BOOT_FLAG_DICEDIS_Msk           (_UINT32_(0x1) << FUSES_BOOT_FLAG_DICEDIS_Pos)       /* (FUSES_BOOT_FLAG) Device Identifier Composition Engine Disable Mask */
#define FUSES_BOOT_FLAG_DICEDIS(value)        (FUSES_BOOT_FLAG_DICEDIS_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_DICEDIS_Pos)) /* Assignment of value for DICEDIS in the FUSES_BOOT_FLAG register */
#define FUSES_BOOT_FLAG_BOOTMODE_Pos          _UINT32_(4)                                          /* (FUSES_BOOT_FLAG) Boot Mode Position */
#define FUSES_BOOT_FLAG_BOOTMODE_Msk          (_UINT32_(0x1) << FUSES_BOOT_FLAG_BOOTMODE_Pos)      /* (FUSES_BOOT_FLAG) Boot Mode Mask */
#define FUSES_BOOT_FLAG_BOOTMODE(value)       (FUSES_BOOT_FLAG_BOOTMODE_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_BOOTMODE_Pos)) /* Assignment of value for BOOTMODE in the FUSES_BOOT_FLAG register */
#define FUSES_BOOT_FLAG_RAM_INIT_ENB_Pos      _UINT32_(6)                                          /* (FUSES_BOOT_FLAG) RAM ECC Enable Position */
#define FUSES_BOOT_FLAG_RAM_INIT_ENB_Msk      (_UINT32_(0x1) << FUSES_BOOT_FLAG_RAM_INIT_ENB_Pos)  /* (FUSES_BOOT_FLAG) RAM ECC Enable Mask */
#define FUSES_BOOT_FLAG_RAM_INIT_ENB(value)   (FUSES_BOOT_FLAG_RAM_INIT_ENB_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_RAM_INIT_ENB_Pos)) /* Assignment of value for RAM_INIT_ENB in the FUSES_BOOT_FLAG register */
#define FUSES_BOOT_FLAG_PUFSCORE_Pos          _UINT32_(8)                                          /* (FUSES_BOOT_FLAG) PUF Score Value Position */
#define FUSES_BOOT_FLAG_PUFSCORE_Msk          (_UINT32_(0x7) << FUSES_BOOT_FLAG_PUFSCORE_Pos)      /* (FUSES_BOOT_FLAG) PUF Score Value Mask */
#define FUSES_BOOT_FLAG_PUFSCORE(value)       (FUSES_BOOT_FLAG_PUFSCORE_Msk & (_UINT32_(value) << FUSES_BOOT_FLAG_PUFSCORE_Pos)) /* Assignment of value for PUFSCORE in the FUSES_BOOT_FLAG register */
#define   FUSES_BOOT_FLAG_PUFSCORE_0_Val      _UINT32_(0x0)                                        /* (FUSES_BOOT_FLAG) 0  */
#define   FUSES_BOOT_FLAG_PUFSCORE_1_Val      _UINT32_(0x1)                                        /* (FUSES_BOOT_FLAG) 1  */
#define   FUSES_BOOT_FLAG_PUFSCORE_2_Val      _UINT32_(0x2)                                        /* (FUSES_BOOT_FLAG) 2  */
#define   FUSES_BOOT_FLAG_PUFSCORE_3_Val      _UINT32_(0x3)                                        /* (FUSES_BOOT_FLAG) 3  */
#define   FUSES_BOOT_FLAG_PUFSCORE_4_Val      _UINT32_(0x4)                                        /* (FUSES_BOOT_FLAG) 4  */
#define   FUSES_BOOT_FLAG_PUFSCORE_5_Val      _UINT32_(0x5)                                        /* (FUSES_BOOT_FLAG) 5  */
#define   FUSES_BOOT_FLAG_PUFSCORE_6_Val      _UINT32_(0x6)                                        /* (FUSES_BOOT_FLAG) 6  */
#define   FUSES_BOOT_FLAG_PUFSCORE_7_Val      _UINT32_(0x7)                                        /* (FUSES_BOOT_FLAG) 7  */
#define FUSES_BOOT_FLAG_PUFSCORE_0            (FUSES_BOOT_FLAG_PUFSCORE_0_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 0 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_1            (FUSES_BOOT_FLAG_PUFSCORE_1_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 1 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_2            (FUSES_BOOT_FLAG_PUFSCORE_2_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 2 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_3            (FUSES_BOOT_FLAG_PUFSCORE_3_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 3 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_4            (FUSES_BOOT_FLAG_PUFSCORE_4_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 4 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_5            (FUSES_BOOT_FLAG_PUFSCORE_5_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 5 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_6            (FUSES_BOOT_FLAG_PUFSCORE_6_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 6 Position */
#define FUSES_BOOT_FLAG_PUFSCORE_7            (FUSES_BOOT_FLAG_PUFSCORE_7_Val << FUSES_BOOT_FLAG_PUFSCORE_Pos) /* (FUSES_BOOT_FLAG) 7 Position */
#define FUSES_BOOT_FLAG_Msk                   _UINT32_(0x0000075E)                                 /* (FUSES_BOOT_FLAG) Register Mask  */


/* -------- FUSES_DICE_CDI_INDEX : (FUSES Offset: 0x810) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_DICE_CDI_INDEX_RESETVALUE       _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_DICE_CDI_INDEX) Mapped Fuse Register  Reset Value */

#define FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX_Pos _UINT32_(0)                                          /* (FUSES_DICE_CDI_INDEX)  Position */
#define FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX_Msk (_UINT32_(0x7F) << FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX_Pos) /* (FUSES_DICE_CDI_INDEX)  Mask */
#define FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX(value) (FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX_Msk & (_UINT32_(value) << FUSES_DICE_CDI_INDEX_DICE_CDI_INDEX_Pos)) /* Assignment of value for DICE_CDI_INDEX in the FUSES_DICE_CDI_INDEX register */
#define FUSES_DICE_CDI_INDEX_Msk              _UINT32_(0x0000007F)                                 /* (FUSES_DICE_CDI_INDEX) Register Mask  */


/* -------- FUSES_DICE_FW_HASH_INDEX : (FUSES Offset: 0x814) (R/W 32) Mapped Fuse Register -------- */
#define FUSES_DICE_FW_HASH_INDEX_RESETVALUE   _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_DICE_FW_HASH_INDEX) Mapped Fuse Register  Reset Value */

#define FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX_Pos _UINT32_(0)                                          /* (FUSES_DICE_FW_HASH_INDEX)  Position */
#define FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX_Msk (_UINT32_(0x7F) << FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX_Pos) /* (FUSES_DICE_FW_HASH_INDEX)  Mask */
#define FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX(value) (FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX_Msk & (_UINT32_(value) << FUSES_DICE_FW_HASH_INDEX_DICE_FW_HASH_INDEX_Pos)) /* Assignment of value for DICE_FW_HASH_INDEX in the FUSES_DICE_FW_HASH_INDEX register */
#define FUSES_DICE_FW_HASH_INDEX_Msk          _UINT32_(0x0000007F)                                 /* (FUSES_DICE_FW_HASH_INDEX) Register Mask  */


/* -------- FUSES_BOOT_GPIOSEL : (FUSES Offset: 0x818) (R/W 32) BOOT EXTERNAL NOTIFICATION IO PIN REGISTER -------- */
#define FUSES_BOOT_GPIOSEL_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOOT_GPIOSEL) BOOT EXTERNAL NOTIFICATION IO PIN REGISTER  Reset Value */

