Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#define FUSES_IDAU_RCTRL_PFMANS_Msk           _UINT32_(0x00000000)                                 /* (FUSES_IDAU_RCTRL_PFMANS) Register Mask  */

/* BLOCK mode */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMANS Command Argument (Block ID) Position */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG_Msk (_UINT32_(0x1F) << FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMANS Command Argument (Block ID) Mask */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG(value) (FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANS_BLOCK_ARG_Pos))
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Position */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Mask */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD(value) (FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_CLRNONSEC_Val _UINT32_(0x5A)                                       /* (FUSES_IDAU_RCTRL_PFMANS) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)  */
#define   FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_SETNONSEC_Val _UINT32_(0x5B)                                       /* (FUSES_IDAU_RCTRL_PFMANS) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)  */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_CLRNONSEC (FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_CLRNONSEC_Val << FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0) Position */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_SETNONSEC (FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_SETNONSEC_Val << FUSES_IDAU_RCTRL_PFMANS_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1) Position */
#define FUSES_IDAU_RCTRL_PFMANS_BLOCK_Msk     _UINT32_(0xFF00001F)                                 /* (FUSES_IDAU_RCTRL_PFMANS_BLOCK) Register Mask  */

/* WATERMARK mode */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Argument (Watermark) Position */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG_Msk (_UINT32_(0xFFFFFF) << FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Argument (Watermark) Mask */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG(value) (FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANS_WATERMARK_ARG_Pos))
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Position */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) IDAU Region Control PFMAN Command Mask */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD(value) (FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_WRSZ_Val _UINT32_(0x5C)                                       /* (FUSES_IDAU_RCTRL_PFMANS) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)  */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_WRSZ (FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_WRSZ_Val << FUSES_IDAU_RCTRL_PFMANS_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANS) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG) Position */
#define FUSES_IDAU_RCTRL_PFMANS_WATERMARK_Msk _UINT32_(0xFFFFFFFF)                                 /* (FUSES_IDAU_RCTRL_PFMANS_WATERMARK) Register Mask  */


/* -------- FUSES_IDAU_RCTRL_PFMANSC : (FUSES Offset: 0x86C) (R/W 32) Region Control -------- */
#define FUSES_IDAU_RCTRL_PFMANSC_RESETVALUE   _UINT32_(0x5C000000)                                 /*  (FUSES_IDAU_RCTRL_PFMANSC) Region Control  Reset Value */

#define FUSES_IDAU_RCTRL_PFMANSC_Msk          _UINT32_(0x00000000)                                 /* (FUSES_IDAU_RCTRL_PFMANSC) Register Mask  */

/* BLOCK mode */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Argument (Block ID) Position */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG_Msk (_UINT32_(0x1F) << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Argument (Block ID) Mask */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG(value) (FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_ARG_Pos))
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Position */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Mask */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD(value) (FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_CLRNONSEC_Val _UINT32_(0x5A)                                       /* (FUSES_IDAU_RCTRL_PFMANSC) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)  */
#define   FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_SETNONSEC_Val _UINT32_(0x5B)                                       /* (FUSES_IDAU_RCTRL_PFMANSC) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)  */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_CLRNONSEC (FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_CLRNONSEC_Val << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0) Position */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_SETNONSEC (FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_SETNONSEC_Val << FUSES_IDAU_RCTRL_PFMANSC_BLOCK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1) Position */
#define FUSES_IDAU_RCTRL_PFMANSC_BLOCK_Msk    _UINT32_(0xFF00001F)                                 /* (FUSES_IDAU_RCTRL_PFMANSC_BLOCK) Register Mask  */

/* WATERMARK mode */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG_Pos _UINT32_(0)                                          /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Argument (Watermark) Position */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG_Msk (_UINT32_(0xFFFFFF) << FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Argument (Watermark) Mask */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG(value) (FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_ARG_Pos))
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Pos _UINT32_(24)                                         /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Position */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Msk (_UINT32_(0xFF) << FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) IDAU Region Control PFMANSC Command Mask */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD(value) (FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Msk & (_UINT32_(value) << FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Pos))
#define   FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_WRSZ_Val _UINT32_(0x5C)                                       /* (FUSES_IDAU_RCTRL_PFMANSC) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)  */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_WRSZ (FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_WRSZ_Val << FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_CMD_Pos) /* (FUSES_IDAU_RCTRL_PFMANSC) Write IDAU region x Size (RSTATUSB[x].SIZE=ARG) Position */
#define FUSES_IDAU_RCTRL_PFMANSC_WATERMARK_Msk _UINT32_(0xFFFFFFFF)                                 /* (FUSES_IDAU_RCTRL_PFMANSC_WATERMARK) Register Mask  */


/* -------- FUSES_IDAU_RCTRL_DRM : (FUSES Offset: 0x870) (R/W 32) Region Control -------- */
#define FUSES_IDAU_RCTRL_DRM_RESETVALUE       _UINT32_(0x5C000000)                                 /*  (FUSES_IDAU_RCTRL_DRM) Region Control  Reset Value */

