Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* -------- FUSES_FCW_CWP : (FUSES Offset: 0x87C) (R/W 32) CFM Page Write Protect REGISTER -------- */
#define FUSES_FCW_CWP_RESETVALUE              _UINT32_(0x00)                                       /*  (FUSES_FCW_CWP) CFM Page Write Protect REGISTER  Reset Value */

#define FUSES_FCW_CWP_BC1AWP_Pos              _UINT32_(0)                                          /* (FUSES_FCW_CWP) Panel 1 Write Protect BootCfg1A Position */
#define FUSES_FCW_CWP_BC1AWP_Msk              (_UINT32_(0x1) << FUSES_FCW_CWP_BC1AWP_Pos)          /* (FUSES_FCW_CWP) Panel 1 Write Protect BootCfg1A Mask */
#define FUSES_FCW_CWP_BC1AWP(value)           (FUSES_FCW_CWP_BC1AWP_Msk & (_UINT32_(value) << FUSES_FCW_CWP_BC1AWP_Pos)) /* Assignment of value for BC1AWP in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_BC1AWP_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FUSES_FCW_CWP_BC1AWP_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FUSES_FCW_CWP_BC1AWP_DISABLE          (FUSES_FCW_CWP_BC1AWP_DISABLE_Val << FUSES_FCW_CWP_BC1AWP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FUSES_FCW_CWP_BC1AWP_ENABLE           (FUSES_FCW_CWP_BC1AWP_ENABLE_Val << FUSES_FCW_CWP_BC1AWP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FUSES_FCW_CWP_BC1WP_Pos               _UINT32_(2)                                          /* (FUSES_FCW_CWP) Panel 1 Write Protect BootCfg1 Position */
#define FUSES_FCW_CWP_BC1WP_Msk               (_UINT32_(0x1) << FUSES_FCW_CWP_BC1WP_Pos)           /* (FUSES_FCW_CWP) Panel 1 Write Protect BootCfg1 Mask */
#define FUSES_FCW_CWP_BC1WP(value)            (FUSES_FCW_CWP_BC1WP_Msk & (_UINT32_(value) << FUSES_FCW_CWP_BC1WP_Pos)) /* Assignment of value for BC1WP in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_BC1WP_DISABLE_Val     _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FUSES_FCW_CWP_BC1WP_ENABLE_Val      _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FUSES_FCW_CWP_BC1WP_DISABLE           (FUSES_FCW_CWP_BC1WP_DISABLE_Val << FUSES_FCW_CWP_BC1WP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FUSES_FCW_CWP_BC1WP_ENABLE            (FUSES_FCW_CWP_BC1WP_ENABLE_Val << FUSES_FCW_CWP_BC1WP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FUSES_FCW_CWP_RCWP_Pos                _UINT32_(3)                                          /* (FUSES_FCW_CWP) Panel 1 Write Protect ROMCfg Position */
#define FUSES_FCW_CWP_RCWP_Msk                (_UINT32_(0x1) << FUSES_FCW_CWP_RCWP_Pos)            /* (FUSES_FCW_CWP) Panel 1 Write Protect ROMCfg Mask */
#define FUSES_FCW_CWP_RCWP(value)             (FUSES_FCW_CWP_RCWP_Msk & (_UINT32_(value) << FUSES_FCW_CWP_RCWP_Pos)) /* Assignment of value for RCWP in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_RCWP_DISABLE_Val      _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FUSES_FCW_CWP_RCWP_ENABLE_Val       _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FUSES_FCW_CWP_RCWP_DISABLE            (FUSES_FCW_CWP_RCWP_DISABLE_Val << FUSES_FCW_CWP_RCWP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FUSES_FCW_CWP_RCWP_ENABLE             (FUSES_FCW_CWP_RCWP_ENABLE_Val << FUSES_FCW_CWP_RCWP_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FUSES_FCW_CWP_VSSWP0_Pos              _UINT32_(4)                                          /* (FUSES_FCW_CWP) Panel 1 Write Protect VSSn Position */
#define FUSES_FCW_CWP_VSSWP0_Msk              (_UINT32_(0x1) << FUSES_FCW_CWP_VSSWP0_Pos)          /* (FUSES_FCW_CWP) Panel 1 Write Protect VSSn Mask */
#define FUSES_FCW_CWP_VSSWP0(value)           (FUSES_FCW_CWP_VSSWP0_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWP0_Pos)) /* Assignment of value for VSSWP0 in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_VSSWP0_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FUSES_FCW_CWP_VSSWP0_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FUSES_FCW_CWP_VSSWP0_DISABLE          (FUSES_FCW_CWP_VSSWP0_DISABLE_Val << FUSES_FCW_CWP_VSSWP0_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FUSES_FCW_CWP_VSSWP0_ENABLE           (FUSES_FCW_CWP_VSSWP0_ENABLE_Val << FUSES_FCW_CWP_VSSWP0_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FUSES_FCW_CWP_VSSWP1_Pos              _UINT32_(5)                                          /* (FUSES_FCW_CWP) Panel 1 Write Protect VSSn Position */
#define FUSES_FCW_CWP_VSSWP1_Msk              (_UINT32_(0x1) << FUSES_FCW_CWP_VSSWP1_Pos)          /* (FUSES_FCW_CWP) Panel 1 Write Protect VSSn Mask */
#define FUSES_FCW_CWP_VSSWP1(value)           (FUSES_FCW_CWP_VSSWP1_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWP1_Pos)) /* Assignment of value for VSSWP1 in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_VSSWP1_DISABLE_Val    _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FUSES_FCW_CWP_VSSWP1_ENABLE_Val     _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FUSES_FCW_CWP_VSSWP1_DISABLE          (FUSES_FCW_CWP_VSSWP1_DISABLE_Val << FUSES_FCW_CWP_VSSWP1_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FUSES_FCW_CWP_VSSWP1_ENABLE           (FUSES_FCW_CWP_VSSWP1_ENABLE_Val << FUSES_FCW_CWP_VSSWP1_Pos) /* (FUSES_FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FUSES_FCW_CWP_BC1AWPLOCK_Pos          _UINT32_(16)                                         /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection BootCfg1A Position */
#define FUSES_FCW_CWP_BC1AWPLOCK_Msk          (_UINT32_(0x1) << FUSES_FCW_CWP_BC1AWPLOCK_Pos)      /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection BootCfg1A Mask */
#define FUSES_FCW_CWP_BC1AWPLOCK(value)       (FUSES_FCW_CWP_BC1AWPLOCK_Msk & (_UINT32_(value) << FUSES_FCW_CWP_BC1AWPLOCK_Pos)) /* Assignment of value for BC1AWPLOCK in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_BC1AWPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCW_CWP_BC1AWPLOCK_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCW_CWP_BC1AWPLOCK_UNLOCKED     (FUSES_FCW_CWP_BC1AWPLOCK_UNLOCKED_Val << FUSES_FCW_CWP_BC1AWPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCW_CWP_BC1AWPLOCK_LOCKED       (FUSES_FCW_CWP_BC1AWPLOCK_LOCKED_Val << FUSES_FCW_CWP_BC1AWPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCW_CWP_BC1WPLOCK_Pos           _UINT32_(18)                                         /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection BootCfg1 Position */
#define FUSES_FCW_CWP_BC1WPLOCK_Msk           (_UINT32_(0x1) << FUSES_FCW_CWP_BC1WPLOCK_Pos)       /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection BootCfg1 Mask */
#define FUSES_FCW_CWP_BC1WPLOCK(value)        (FUSES_FCW_CWP_BC1WPLOCK_Msk & (_UINT32_(value) << FUSES_FCW_CWP_BC1WPLOCK_Pos)) /* Assignment of value for BC1WPLOCK in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_BC1WPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCW_CWP_BC1WPLOCK_LOCKED_Val  _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCW_CWP_BC1WPLOCK_UNLOCKED      (FUSES_FCW_CWP_BC1WPLOCK_UNLOCKED_Val << FUSES_FCW_CWP_BC1WPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCW_CWP_BC1WPLOCK_LOCKED        (FUSES_FCW_CWP_BC1WPLOCK_LOCKED_Val << FUSES_FCW_CWP_BC1WPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCW_CWP_RCWPLOCK_Pos            _UINT32_(19)                                         /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection ROMCfg Position */
#define FUSES_FCW_CWP_RCWPLOCK_Msk            (_UINT32_(0x1) << FUSES_FCW_CWP_RCWPLOCK_Pos)        /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection ROMCfg Mask */
#define FUSES_FCW_CWP_RCWPLOCK(value)         (FUSES_FCW_CWP_RCWPLOCK_Msk & (_UINT32_(value) << FUSES_FCW_CWP_RCWPLOCK_Pos)) /* Assignment of value for RCWPLOCK in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_RCWPLOCK_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCW_CWP_RCWPLOCK_LOCKED_Val   _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCW_CWP_RCWPLOCK_UNLOCKED       (FUSES_FCW_CWP_RCWPLOCK_UNLOCKED_Val << FUSES_FCW_CWP_RCWPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCW_CWP_RCWPLOCK_LOCKED         (FUSES_FCW_CWP_RCWPLOCK_LOCKED_Val << FUSES_FCW_CWP_RCWPLOCK_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCW_CWP_VSSWPLOCK0_Pos          _UINT32_(20)                                         /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection VSSn Position */
#define FUSES_FCW_CWP_VSSWPLOCK0_Msk          (_UINT32_(0x1) << FUSES_FCW_CWP_VSSWPLOCK0_Pos)      /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection VSSn Mask */
#define FUSES_FCW_CWP_VSSWPLOCK0(value)       (FUSES_FCW_CWP_VSSWPLOCK0_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWPLOCK0_Pos)) /* Assignment of value for VSSWPLOCK0 in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_VSSWPLOCK0_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCW_CWP_VSSWPLOCK0_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCW_CWP_VSSWPLOCK0_UNLOCKED     (FUSES_FCW_CWP_VSSWPLOCK0_UNLOCKED_Val << FUSES_FCW_CWP_VSSWPLOCK0_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCW_CWP_VSSWPLOCK0_LOCKED       (FUSES_FCW_CWP_VSSWPLOCK0_LOCKED_Val << FUSES_FCW_CWP_VSSWPLOCK0_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCW_CWP_VSSWPLOCK1_Pos          _UINT32_(21)                                         /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection VSSn Position */
#define FUSES_FCW_CWP_VSSWPLOCK1_Msk          (_UINT32_(0x1) << FUSES_FCW_CWP_VSSWPLOCK1_Pos)      /* (FUSES_FCW_CWP) Panel 1 Lock Write Protection VSSn Mask */
#define FUSES_FCW_CWP_VSSWPLOCK1(value)       (FUSES_FCW_CWP_VSSWPLOCK1_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWPLOCK1_Pos)) /* Assignment of value for VSSWPLOCK1 in the FUSES_FCW_CWP register */
#define   FUSES_FCW_CWP_VSSWPLOCK1_UNLOCKED_Val _UINT32_(0x0)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FUSES_FCW_CWP_VSSWPLOCK1_LOCKED_Val _UINT32_(0x1)                                        /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FUSES_FCW_CWP_VSSWPLOCK1_UNLOCKED     (FUSES_FCW_CWP_VSSWPLOCK1_UNLOCKED_Val << FUSES_FCW_CWP_VSSWPLOCK1_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FUSES_FCW_CWP_VSSWPLOCK1_LOCKED       (FUSES_FCW_CWP_VSSWPLOCK1_LOCKED_Val << FUSES_FCW_CWP_VSSWPLOCK1_Pos) /* (FUSES_FCW_CWP) The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FUSES_FCW_CWP_Msk                     _UINT32_(0x003D003D)                                 /* (FUSES_FCW_CWP) Register Mask  */

#define FUSES_FCW_CWP_VSSWP_Pos               _UINT32_(4)                                          /* (FUSES_FCW_CWP Position) Panel x Write Protect VSSn */
#define FUSES_FCW_CWP_VSSWP_Msk               (_UINT32_(0x3) << FUSES_FCW_CWP_VSSWP_Pos)           /* (FUSES_FCW_CWP Mask) VSSWP */
#define FUSES_FCW_CWP_VSSWP(value)            (FUSES_FCW_CWP_VSSWP_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWP_Pos)) 
#define FUSES_FCW_CWP_VSSWPLOCK_Pos           _UINT32_(20)                                         /* (FUSES_FCW_CWP Position) Panel x Lock Write Protection VSSn */
#define FUSES_FCW_CWP_VSSWPLOCK_Msk           (_UINT32_(0x3) << FUSES_FCW_CWP_VSSWPLOCK_Pos)       /* (FUSES_FCW_CWP Mask) VSSWPLOCK */
#define FUSES_FCW_CWP_VSSWPLOCK(value)        (FUSES_FCW_CWP_VSSWPLOCK_Msk & (_UINT32_(value) << FUSES_FCW_CWP_VSSWPLOCK_Pos)) 

/* -------- FUSES_FCR_CRP : (FUSES Offset: 0x880) (R/W 32) CFM Page Read Protection Register -------- */
#define FUSES_FCR_CRP_RESETVALUE              _UINT32_(0x00)                                       /*  (FUSES_FCR_CRP) CFM Page Read Protection Register  Reset Value */

