Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* -------- FUSES_SUPC_BRCFGUDSSMOR : (FUSES Offset: 0x890) (R/W 32) Boot Rom Configurable DSSMOR User CFG register -------- */
#define FUSES_SUPC_BRCFGUDSSMOR_RESETVALUE    _UINT32_(0x00)                                       /*  (FUSES_SUPC_BRCFGUDSSMOR) Boot Rom Configurable DSSMOR User CFG register  Reset Value */

#define FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Pos  _UINT32_(0)                                          /* (FUSES_SUPC_BRCFGUDSSMOR) Refer to pwr_smor_ds_[nn]_v2 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Msk  (_UINT32_(0x1) << FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) Refer to pwr_smor_ds_[nn]_v2 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST(value) (FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Pos)) /* Assignment of value for BOR_HYST in the FUSES_SUPC_BRCFGUDSSMOR register */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_LOW_Val _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) Low Hysteresis (default)  */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_HIGH_Val _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) High Hysteresis  */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_LOW  (FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_LOW_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) Low Hysteresis (default) Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_HIGH (FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_HIGH_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_HYST_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) High Hysteresis Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos  _UINT32_(1)                                          /* (FUSES_SUPC_BRCFGUDSSMOR) Nominal BOR Trip, Refer to pwr_smor_ds_[nn]_v2 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Msk  (_UINT32_(0x3) << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) Nominal BOR Trip, Refer to pwr_smor_ds_[nn]_v2 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP(value) (FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos)) /* Assignment of value for BOR_TRIP in the FUSES_SUPC_BRCFGUDSSMOR register */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_0_Val _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) 1.61V (default)  */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_1_Val _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) 2.12V  */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_2_Val _UINT32_(0x2)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) 2.55V  */
#define   FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_3_Val _UINT32_(0x3)                                        /* (FUSES_SUPC_BRCFGUDSSMOR) 2.8V  */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_0    (FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_0_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) 1.61V (default) Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_1    (FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_1_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) 2.12V Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_2    (FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_2_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) 2.55V Position */
#define FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_3    (FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_3_Val << FUSES_SUPC_BRCFGUDSSMOR_BOR_TRIP_Pos) /* (FUSES_SUPC_BRCFGUDSSMOR) 2.8V Position */
#define FUSES_SUPC_BRCFGUDSSMOR_Msk           _UINT32_(0x00000007)                                 /* (FUSES_SUPC_BRCFGUDSSMOR) Register Mask  */


/* -------- FUSES_SUPC_BRCFGUCP0 : (FUSES Offset: 0x894) (R/W 32) Boot Rom Configurable CHARGE PUMP User CFG register -------- */
#define FUSES_SUPC_BRCFGUCP0_RESETVALUE       _UINT32_(0x01)                                       /*  (FUSES_SUPC_BRCFGUCP0) Boot Rom Configurable CHARGE PUMP User CFG register  Reset Value */

#define FUSES_SUPC_BRCFGUCP0_CP_Pos           _UINT32_(0)                                          /* (FUSES_SUPC_BRCFGUCP0) Refer to vreg_chrg_pump_v4 DOS document for details. Position */
#define FUSES_SUPC_BRCFGUCP0_CP_Msk           (_UINT32_(0xF) << FUSES_SUPC_BRCFGUCP0_CP_Pos)       /* (FUSES_SUPC_BRCFGUCP0) Refer to vreg_chrg_pump_v4 DOS document for details. Mask */
#define FUSES_SUPC_BRCFGUCP0_CP(value)        (FUSES_SUPC_BRCFGUCP0_CP_Msk & (_UINT32_(value) << FUSES_SUPC_BRCFGUCP0_CP_Pos)) /* Assignment of value for CP in the FUSES_SUPC_BRCFGUCP0 register */
#define   FUSES_SUPC_BRCFGUCP0_CP_0_Val       _UINT32_(0x0)                                        /* (FUSES_SUPC_BRCFGUCP0) Clock gating trip optimized for low output threshold voltage (3.01V)  */
#define   FUSES_SUPC_BRCFGUCP0_CP_1_Val       _UINT32_(0x1)                                        /* (FUSES_SUPC_BRCFGUCP0) Clock gating trip optimized for high output threshold voltage (3.2V) (default)  */
#define FUSES_SUPC_BRCFGUCP0_CP_0             (FUSES_SUPC_BRCFGUCP0_CP_0_Val << FUSES_SUPC_BRCFGUCP0_CP_Pos) /* (FUSES_SUPC_BRCFGUCP0) Clock gating trip optimized for low output threshold voltage (3.01V) Position */
#define FUSES_SUPC_BRCFGUCP0_CP_1             (FUSES_SUPC_BRCFGUCP0_CP_1_Val << FUSES_SUPC_BRCFGUCP0_CP_Pos) /* (FUSES_SUPC_BRCFGUCP0) Clock gating trip optimized for high output threshold voltage (3.2V) (default) Position */
#define FUSES_SUPC_BRCFGUCP0_Msk              _UINT32_(0x0000000F)                                 /* (FUSES_SUPC_BRCFGUCP0) Register Mask  */


/* -------- FUSES_WDT_SETUP : (FUSES Offset: 0x898) (R/W 32)  -------- */
#define FUSES_WDT_SETUP_RESETVALUE            _UINT32_(0x00)                                       /*  (FUSES_WDT_SETUP)   Reset Value */

#define FUSES_WDT_SETUP_ENABLE_Pos            _UINT32_(1)                                          /* (FUSES_WDT_SETUP) Enable Position */
#define FUSES_WDT_SETUP_ENABLE_Msk            (_UINT32_(0x1) << FUSES_WDT_SETUP_ENABLE_Pos)        /* (FUSES_WDT_SETUP) Enable Mask */
#define FUSES_WDT_SETUP_ENABLE(value)         (FUSES_WDT_SETUP_ENABLE_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_ENABLE_Pos)) /* Assignment of value for ENABLE in the FUSES_WDT_SETUP register */
#define FUSES_WDT_SETUP_WEN_Pos               _UINT32_(2)                                          /* (FUSES_WDT_SETUP) Watchdog Timer Window Mode Enable Position */
#define FUSES_WDT_SETUP_WEN_Msk               (_UINT32_(0x1) << FUSES_WDT_SETUP_WEN_Pos)           /* (FUSES_WDT_SETUP) Watchdog Timer Window Mode Enable Mask */
#define FUSES_WDT_SETUP_WEN(value)            (FUSES_WDT_SETUP_WEN_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_WEN_Pos)) /* Assignment of value for WEN in the FUSES_WDT_SETUP register */
#define FUSES_WDT_SETUP_RUNSTDBY_Pos          _UINT32_(6)                                          /* (FUSES_WDT_SETUP) Run During Standby Position */
#define FUSES_WDT_SETUP_RUNSTDBY_Msk          (_UINT32_(0x1) << FUSES_WDT_SETUP_RUNSTDBY_Pos)      /* (FUSES_WDT_SETUP) Run During Standby Mask */
#define FUSES_WDT_SETUP_RUNSTDBY(value)       (FUSES_WDT_SETUP_RUNSTDBY_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the FUSES_WDT_SETUP register */
#define FUSES_WDT_SETUP_ALWAYSON_Pos          _UINT32_(7)                                          /* (FUSES_WDT_SETUP) Always-On Position */
#define FUSES_WDT_SETUP_ALWAYSON_Msk          (_UINT32_(0x1) << FUSES_WDT_SETUP_ALWAYSON_Pos)      /* (FUSES_WDT_SETUP) Always-On Mask */
#define FUSES_WDT_SETUP_ALWAYSON(value)       (FUSES_WDT_SETUP_ALWAYSON_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_ALWAYSON_Pos)) /* Assignment of value for ALWAYSON in the FUSES_WDT_SETUP register */
#define FUSES_WDT_SETUP_PER_Pos               _UINT32_(8)                                          /* (FUSES_WDT_SETUP) Time-Out Period Position */
#define FUSES_WDT_SETUP_PER_Msk               (_UINT32_(0xF) << FUSES_WDT_SETUP_PER_Pos)           /* (FUSES_WDT_SETUP) Time-Out Period Mask */
#define FUSES_WDT_SETUP_PER(value)            (FUSES_WDT_SETUP_PER_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_PER_Pos)) /* Assignment of value for PER in the FUSES_WDT_SETUP register */
#define   FUSES_WDT_SETUP_PER_CYC8_Val        _UINT32_(0x0)                                        /* (FUSES_WDT_SETUP) 8 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC16_Val       _UINT32_(0x1)                                        /* (FUSES_WDT_SETUP) 16 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC32_Val       _UINT32_(0x2)                                        /* (FUSES_WDT_SETUP) 32 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC64_Val       _UINT32_(0x3)                                        /* (FUSES_WDT_SETUP) 64 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC128_Val      _UINT32_(0x4)                                        /* (FUSES_WDT_SETUP) 128 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC256_Val      _UINT32_(0x5)                                        /* (FUSES_WDT_SETUP) 256 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC512_Val      _UINT32_(0x6)                                        /* (FUSES_WDT_SETUP) 512 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC1024_Val     _UINT32_(0x7)                                        /* (FUSES_WDT_SETUP) 1024 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC2048_Val     _UINT32_(0x8)                                        /* (FUSES_WDT_SETUP) 2048 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC4096_Val     _UINT32_(0x9)                                        /* (FUSES_WDT_SETUP) 4096 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC8192_Val     _UINT32_(0xA)                                        /* (FUSES_WDT_SETUP) 8192 clock cycles  */
#define   FUSES_WDT_SETUP_PER_CYC16384_Val    _UINT32_(0xB)                                        /* (FUSES_WDT_SETUP) 16384 clock cycles  */
#define FUSES_WDT_SETUP_PER_CYC8              (FUSES_WDT_SETUP_PER_CYC8_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 8 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC16             (FUSES_WDT_SETUP_PER_CYC16_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 16 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC32             (FUSES_WDT_SETUP_PER_CYC32_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 32 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC64             (FUSES_WDT_SETUP_PER_CYC64_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 64 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC128            (FUSES_WDT_SETUP_PER_CYC128_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 128 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC256            (FUSES_WDT_SETUP_PER_CYC256_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 256 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC512            (FUSES_WDT_SETUP_PER_CYC512_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 512 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC1024           (FUSES_WDT_SETUP_PER_CYC1024_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 1024 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC2048           (FUSES_WDT_SETUP_PER_CYC2048_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 2048 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC4096           (FUSES_WDT_SETUP_PER_CYC4096_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 4096 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC8192           (FUSES_WDT_SETUP_PER_CYC8192_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 8192 clock cycles Position */
#define FUSES_WDT_SETUP_PER_CYC16384          (FUSES_WDT_SETUP_PER_CYC16384_Val << FUSES_WDT_SETUP_PER_Pos) /* (FUSES_WDT_SETUP) 16384 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_Pos            _UINT32_(12)                                         /* (FUSES_WDT_SETUP) Window Mode Time-Out Period Position */
#define FUSES_WDT_SETUP_WINDOW_Msk            (_UINT32_(0xF) << FUSES_WDT_SETUP_WINDOW_Pos)        /* (FUSES_WDT_SETUP) Window Mode Time-Out Period Mask */
#define FUSES_WDT_SETUP_WINDOW(value)         (FUSES_WDT_SETUP_WINDOW_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_WINDOW_Pos)) /* Assignment of value for WINDOW in the FUSES_WDT_SETUP register */
#define   FUSES_WDT_SETUP_WINDOW_CYC8_Val     _UINT32_(0x0)                                        /* (FUSES_WDT_SETUP) 8 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC16_Val    _UINT32_(0x1)                                        /* (FUSES_WDT_SETUP) 16 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC32_Val    _UINT32_(0x2)                                        /* (FUSES_WDT_SETUP) 32 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC64_Val    _UINT32_(0x3)                                        /* (FUSES_WDT_SETUP) 64 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC128_Val   _UINT32_(0x4)                                        /* (FUSES_WDT_SETUP) 128 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC256_Val   _UINT32_(0x5)                                        /* (FUSES_WDT_SETUP) 256 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC512_Val   _UINT32_(0x6)                                        /* (FUSES_WDT_SETUP) 512 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC1024_Val  _UINT32_(0x7)                                        /* (FUSES_WDT_SETUP) 1024 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC2048_Val  _UINT32_(0x8)                                        /* (FUSES_WDT_SETUP) 2048 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC4096_Val  _UINT32_(0x9)                                        /* (FUSES_WDT_SETUP) 4096 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC8192_Val  _UINT32_(0xA)                                        /* (FUSES_WDT_SETUP) 8192 clock cycles  */
#define   FUSES_WDT_SETUP_WINDOW_CYC16384_Val _UINT32_(0xB)                                        /* (FUSES_WDT_SETUP) 16384 clock cycles  */
#define FUSES_WDT_SETUP_WINDOW_CYC8           (FUSES_WDT_SETUP_WINDOW_CYC8_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 8 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC16          (FUSES_WDT_SETUP_WINDOW_CYC16_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 16 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC32          (FUSES_WDT_SETUP_WINDOW_CYC32_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 32 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC64          (FUSES_WDT_SETUP_WINDOW_CYC64_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 64 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC128         (FUSES_WDT_SETUP_WINDOW_CYC128_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 128 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC256         (FUSES_WDT_SETUP_WINDOW_CYC256_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 256 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC512         (FUSES_WDT_SETUP_WINDOW_CYC512_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 512 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC1024        (FUSES_WDT_SETUP_WINDOW_CYC1024_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 1024 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC2048        (FUSES_WDT_SETUP_WINDOW_CYC2048_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 2048 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC4096        (FUSES_WDT_SETUP_WINDOW_CYC4096_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 4096 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC8192        (FUSES_WDT_SETUP_WINDOW_CYC8192_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 8192 clock cycles Position */
#define FUSES_WDT_SETUP_WINDOW_CYC16384       (FUSES_WDT_SETUP_WINDOW_CYC16384_Val << FUSES_WDT_SETUP_WINDOW_Pos) /* (FUSES_WDT_SETUP) 16384 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_Pos          _UINT32_(16)                                         /* (FUSES_WDT_SETUP) Early Warning Interrupt Time Offset Position */
#define FUSES_WDT_SETUP_EWOFFSET_Msk          (_UINT32_(0xF) << FUSES_WDT_SETUP_EWOFFSET_Pos)      /* (FUSES_WDT_SETUP) Early Warning Interrupt Time Offset Mask */
#define FUSES_WDT_SETUP_EWOFFSET(value)       (FUSES_WDT_SETUP_EWOFFSET_Msk & (_UINT32_(value) << FUSES_WDT_SETUP_EWOFFSET_Pos)) /* Assignment of value for EWOFFSET in the FUSES_WDT_SETUP register */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC8_Val   _UINT32_(0x0)                                        /* (FUSES_WDT_SETUP) 8 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC16_Val  _UINT32_(0x1)                                        /* (FUSES_WDT_SETUP) 16 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC32_Val  _UINT32_(0x2)                                        /* (FUSES_WDT_SETUP) 32 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC64_Val  _UINT32_(0x3)                                        /* (FUSES_WDT_SETUP) 64 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC128_Val _UINT32_(0x4)                                        /* (FUSES_WDT_SETUP) 128 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC256_Val _UINT32_(0x5)                                        /* (FUSES_WDT_SETUP) 256 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC512_Val _UINT32_(0x6)                                        /* (FUSES_WDT_SETUP) 512 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC1024_Val _UINT32_(0x7)                                        /* (FUSES_WDT_SETUP) 1024 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC2048_Val _UINT32_(0x8)                                        /* (FUSES_WDT_SETUP) 2048 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC4096_Val _UINT32_(0x9)                                        /* (FUSES_WDT_SETUP) 4096 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC8192_Val _UINT32_(0xA)                                        /* (FUSES_WDT_SETUP) 8192 clock cycles  */
#define   FUSES_WDT_SETUP_EWOFFSET_CYC16384_Val _UINT32_(0xB)                                        /* (FUSES_WDT_SETUP) 16384 clock cycles  */
#define FUSES_WDT_SETUP_EWOFFSET_CYC8         (FUSES_WDT_SETUP_EWOFFSET_CYC8_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 8 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC16        (FUSES_WDT_SETUP_EWOFFSET_CYC16_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 16 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC32        (FUSES_WDT_SETUP_EWOFFSET_CYC32_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 32 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC64        (FUSES_WDT_SETUP_EWOFFSET_CYC64_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 64 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC128       (FUSES_WDT_SETUP_EWOFFSET_CYC128_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 128 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC256       (FUSES_WDT_SETUP_EWOFFSET_CYC256_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 256 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC512       (FUSES_WDT_SETUP_EWOFFSET_CYC512_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 512 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC1024      (FUSES_WDT_SETUP_EWOFFSET_CYC1024_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 1024 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC2048      (FUSES_WDT_SETUP_EWOFFSET_CYC2048_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 2048 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC4096      (FUSES_WDT_SETUP_EWOFFSET_CYC4096_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 4096 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC8192      (FUSES_WDT_SETUP_EWOFFSET_CYC8192_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 8192 clock cycles Position */
#define FUSES_WDT_SETUP_EWOFFSET_CYC16384     (FUSES_WDT_SETUP_EWOFFSET_CYC16384_Val << FUSES_WDT_SETUP_EWOFFSET_Pos) /* (FUSES_WDT_SETUP) 16384 clock cycles Position */
#define FUSES_WDT_SETUP_Msk                   _UINT32_(0x000FFFC6)                                 /* (FUSES_WDT_SETUP) Register Mask  */


