Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* -------- FUSES_FCCFG33 : (FUSES Offset: 0x104) ( R/ 32) DSU Device Configuration 1 Register -------- */
#define FUSES_FCCFG33_ME_CAM_Pos              _UINT32_(7)                                          /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_CAM_Msk              (_UINT32_(0x1) << FUSES_FCCFG33_ME_CAM_Pos)          /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_CAM(value)           (FUSES_FCCFG33_ME_CAM_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_CAM_Pos)) /* Assignment of value for ME_CAM in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_CAM_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_CAM_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_CAM_0                (FUSES_FCCFG33_ME_CAM_0_Val << FUSES_FCCFG33_ME_CAM_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_CAM_1                (FUSES_FCCFG33_ME_CAM_1_Val << FUSES_FCCFG33_ME_CAM_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC0_Pos             _UINT32_(8)                                          /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC0_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC0_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC0(value)          (FUSES_FCCFG33_ME_TCC0_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC0_Pos)) /* Assignment of value for ME_TCC0 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC0_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC0_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC0_0               (FUSES_FCCFG33_ME_TCC0_0_Val << FUSES_FCCFG33_ME_TCC0_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC0_1               (FUSES_FCCFG33_ME_TCC0_1_Val << FUSES_FCCFG33_ME_TCC0_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC1_Pos             _UINT32_(9)                                          /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC1_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC1_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC1(value)          (FUSES_FCCFG33_ME_TCC1_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC1_Pos)) /* Assignment of value for ME_TCC1 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC1_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC1_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC1_0               (FUSES_FCCFG33_ME_TCC1_0_Val << FUSES_FCCFG33_ME_TCC1_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC1_1               (FUSES_FCCFG33_ME_TCC1_1_Val << FUSES_FCCFG33_ME_TCC1_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC2_Pos             _UINT32_(10)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC2_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC2_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC2(value)          (FUSES_FCCFG33_ME_TCC2_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC2_Pos)) /* Assignment of value for ME_TCC2 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC2_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC2_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC2_0               (FUSES_FCCFG33_ME_TCC2_0_Val << FUSES_FCCFG33_ME_TCC2_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC2_1               (FUSES_FCCFG33_ME_TCC2_1_Val << FUSES_FCCFG33_ME_TCC2_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC3_Pos             _UINT32_(11)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC3_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC3_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC3(value)          (FUSES_FCCFG33_ME_TCC3_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC3_Pos)) /* Assignment of value for ME_TCC3 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC3_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC3_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC3_0               (FUSES_FCCFG33_ME_TCC3_0_Val << FUSES_FCCFG33_ME_TCC3_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC3_1               (FUSES_FCCFG33_ME_TCC3_1_Val << FUSES_FCCFG33_ME_TCC3_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC4_Pos             _UINT32_(12)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC4_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC4_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC4(value)          (FUSES_FCCFG33_ME_TCC4_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC4_Pos)) /* Assignment of value for ME_TCC4 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC4_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC4_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC4_0               (FUSES_FCCFG33_ME_TCC4_0_Val << FUSES_FCCFG33_ME_TCC4_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC4_1               (FUSES_FCCFG33_ME_TCC4_1_Val << FUSES_FCCFG33_ME_TCC4_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC5_Pos             _UINT32_(13)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC5_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC5_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC5(value)          (FUSES_FCCFG33_ME_TCC5_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC5_Pos)) /* Assignment of value for ME_TCC5 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC5_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC5_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC5_0               (FUSES_FCCFG33_ME_TCC5_0_Val << FUSES_FCCFG33_ME_TCC5_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC5_1               (FUSES_FCCFG33_ME_TCC5_1_Val << FUSES_FCCFG33_ME_TCC5_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_TCC6_Pos             _UINT32_(14)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_TCC6_Msk             (_UINT32_(0x1) << FUSES_FCCFG33_ME_TCC6_Pos)         /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_TCC6(value)          (FUSES_FCCFG33_ME_TCC6_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_TCC6_Pos)) /* Assignment of value for ME_TCC6 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_TCC6_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_TCC6_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_TCC6_0               (FUSES_FCCFG33_ME_TCC6_0_Val << FUSES_FCCFG33_ME_TCC6_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_TCC6_1               (FUSES_FCCFG33_ME_TCC6_1_Val << FUSES_FCCFG33_ME_TCC6_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM0_Pos          _UINT32_(18)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM0_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM0_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM0(value)       (FUSES_FCCFG33_ME_SERCOM0_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM0_Pos)) /* Assignment of value for ME_SERCOM0 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM0_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM0_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM0_0            (FUSES_FCCFG33_ME_SERCOM0_0_Val << FUSES_FCCFG33_ME_SERCOM0_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM0_1            (FUSES_FCCFG33_ME_SERCOM0_1_Val << FUSES_FCCFG33_ME_SERCOM0_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM1_Pos          _UINT32_(19)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM1_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM1_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM1(value)       (FUSES_FCCFG33_ME_SERCOM1_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM1_Pos)) /* Assignment of value for ME_SERCOM1 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM1_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM1_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM1_0            (FUSES_FCCFG33_ME_SERCOM1_0_Val << FUSES_FCCFG33_ME_SERCOM1_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM1_1            (FUSES_FCCFG33_ME_SERCOM1_1_Val << FUSES_FCCFG33_ME_SERCOM1_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM2_Pos          _UINT32_(20)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM2_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM2_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM2(value)       (FUSES_FCCFG33_ME_SERCOM2_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM2_Pos)) /* Assignment of value for ME_SERCOM2 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM2_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM2_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM2_0            (FUSES_FCCFG33_ME_SERCOM2_0_Val << FUSES_FCCFG33_ME_SERCOM2_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM2_1            (FUSES_FCCFG33_ME_SERCOM2_1_Val << FUSES_FCCFG33_ME_SERCOM2_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM3_Pos          _UINT32_(21)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM3_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM3_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM3(value)       (FUSES_FCCFG33_ME_SERCOM3_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM3_Pos)) /* Assignment of value for ME_SERCOM3 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM3_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM3_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM3_0            (FUSES_FCCFG33_ME_SERCOM3_0_Val << FUSES_FCCFG33_ME_SERCOM3_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM3_1            (FUSES_FCCFG33_ME_SERCOM3_1_Val << FUSES_FCCFG33_ME_SERCOM3_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM4_Pos          _UINT32_(22)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM4_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM4_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM4(value)       (FUSES_FCCFG33_ME_SERCOM4_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM4_Pos)) /* Assignment of value for ME_SERCOM4 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM4_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM4_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM4_0            (FUSES_FCCFG33_ME_SERCOM4_0_Val << FUSES_FCCFG33_ME_SERCOM4_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM4_1            (FUSES_FCCFG33_ME_SERCOM4_1_Val << FUSES_FCCFG33_ME_SERCOM4_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_SERCOM5_Pos          _UINT32_(23)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_SERCOM5_Msk          (_UINT32_(0x1) << FUSES_FCCFG33_ME_SERCOM5_Pos)      /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_SERCOM5(value)       (FUSES_FCCFG33_ME_SERCOM5_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_SERCOM5_Pos)) /* Assignment of value for ME_SERCOM5 in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_SERCOM5_0_Val      _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_SERCOM5_1_Val      _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_SERCOM5_0            (FUSES_FCCFG33_ME_SERCOM5_0_Val << FUSES_FCCFG33_ME_SERCOM5_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_SERCOM5_1            (FUSES_FCCFG33_ME_SERCOM5_1_Val << FUSES_FCCFG33_ME_SERCOM5_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_ME_PTC_Pos              _UINT32_(28)                                         /* (FUSES_FCCFG33) Module enables for Variant configuration Position */
#define FUSES_FCCFG33_ME_PTC_Msk              (_UINT32_(0x1) << FUSES_FCCFG33_ME_PTC_Pos)          /* (FUSES_FCCFG33) Module enables for Variant configuration Mask */
#define FUSES_FCCFG33_ME_PTC(value)           (FUSES_FCCFG33_ME_PTC_Msk & (_UINT32_(value) << FUSES_FCCFG33_ME_PTC_Pos)) /* Assignment of value for ME_PTC in the FUSES_FCCFG33 register */
#define   FUSES_FCCFG33_ME_PTC_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG33) Module is Disabled  */
#define   FUSES_FCCFG33_ME_PTC_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG33) Module is Enabled  */
#define FUSES_FCCFG33_ME_PTC_0                (FUSES_FCCFG33_ME_PTC_0_Val << FUSES_FCCFG33_ME_PTC_Pos) /* (FUSES_FCCFG33) Module is Disabled Position */
#define FUSES_FCCFG33_ME_PTC_1                (FUSES_FCCFG33_ME_PTC_1_Val << FUSES_FCCFG33_ME_PTC_Pos) /* (FUSES_FCCFG33) Module is Enabled Position */
#define FUSES_FCCFG33_Msk                     _UINT32_(0x10FC7F80)                                 /* (FUSES_FCCFG33) Register Mask  */

