Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* -------- FUSES_FCCFG57 : (FUSES Offset: 0x164) ( R/ 32) Calibration Configuration 57 Register -------- */
#define FUSES_FCCFG57_DLYVAL_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG57) Delay Value Position */
#define FUSES_FCCFG57_DLYVAL_Msk              (_UINT32_(0x7F) << FUSES_FCCFG57_DLYVAL_Pos)         /* (FUSES_FCCFG57) Delay Value Mask */
#define FUSES_FCCFG57_DLYVAL(value)           (FUSES_FCCFG57_DLYVAL_Msk & (_UINT32_(value) << FUSES_FCCFG57_DLYVAL_Pos)) /* Assignment of value for DLYVAL in the FUSES_FCCFG57 register */
#define FUSES_FCCFG57_IGNACK_Pos              _UINT32_(7)                                          /* (FUSES_FCCFG57) Ignore Acknowledge Position */
#define FUSES_FCCFG57_IGNACK_Msk              (_UINT32_(0x1) << FUSES_FCCFG57_IGNACK_Pos)          /* (FUSES_FCCFG57) Ignore Acknowledge Mask */
#define FUSES_FCCFG57_IGNACK(value)           (FUSES_FCCFG57_IGNACK_Msk & (_UINT32_(value) << FUSES_FCCFG57_IGNACK_Pos)) /* Assignment of value for IGNACK in the FUSES_FCCFG57 register */
#define   FUSES_FCCFG57_IGNACK_0_Val          _UINT32_(0x0)                                        /* (FUSES_FCCFG57) Power Switch acknowledge signal is taken into account when entering/exiting retention mode. According to the DLYVAL field, a supplementary delay is also added (from 0 to 127 digital ring oscillator period)  */
#define   FUSES_FCCFG57_IGNACK_1_Val          _UINT32_(0x1)                                        /* (FUSES_FCCFG57) Power Switch acknowledge signal is ignored when entering/exiting retention mode, and is replaced by a overflow counter signal clocked on internal digital ring oscillator. The overflow counter is programmable by using the DLYVAL field  */
#define FUSES_FCCFG57_IGNACK_0                (FUSES_FCCFG57_IGNACK_0_Val << FUSES_FCCFG57_IGNACK_Pos) /* (FUSES_FCCFG57) Power Switch acknowledge signal is taken into account when entering/exiting retention mode. According to the DLYVAL field, a supplementary delay is also added (from 0 to 127 digital ring oscillator period) Position */
#define FUSES_FCCFG57_IGNACK_1                (FUSES_FCCFG57_IGNACK_1_Val << FUSES_FCCFG57_IGNACK_Pos) /* (FUSES_FCCFG57) Power Switch acknowledge signal is ignored when entering/exiting retention mode, and is replaced by a overflow counter signal clocked on internal digital ring oscillator. The overflow counter is programmable by using the DLYVAL field Position */
#define FUSES_FCCFG57_Msk                     _UINT32_(0x000000FF)                                 /* (FUSES_FCCFG57) Register Mask  */


/* -------- FUSES_FCCFG58 : (FUSES Offset: 0x168) ( R/ 32) Calibration Configuration 58 Register -------- */
#define FUSES_FCCFG58_BRINGOSC_Pos            _UINT32_(0)                                          /* (FUSES_FCCFG58) Backup Ring Oscillator Size Depth Position */
#define FUSES_FCCFG58_BRINGOSC_Msk            (_UINT32_(0x3) << FUSES_FCCFG58_BRINGOSC_Pos)        /* (FUSES_FCCFG58) Backup Ring Oscillator Size Depth Mask */
#define FUSES_FCCFG58_BRINGOSC(value)         (FUSES_FCCFG58_BRINGOSC_Msk & (_UINT32_(value) << FUSES_FCCFG58_BRINGOSC_Pos)) /* Assignment of value for BRINGOSC in the FUSES_FCCFG58 register */
#define   FUSES_FCCFG58_BRINGOSC_0_Val        _UINT32_(0x0)                                        /* (FUSES_FCCFG58) Ring Oscillator depth is default (DLY0)  */
#define   FUSES_FCCFG58_BRINGOSC_1_Val        _UINT32_(0x1)                                        /* (FUSES_FCCFG58) Ring Oscillator depth is default + 1 ORDLY15 (DLY1)  */
#define   FUSES_FCCFG58_BRINGOSC_2_Val        _UINT32_(0x2)                                        /* (FUSES_FCCFG58) Ring Oscillator depth is default + 2 ORDLU15 (DLY2)  */
#define   FUSES_FCCFG58_BRINGOSC_3_Val        _UINT32_(0x3)                                        /* (FUSES_FCCFG58) Ring Oscillator depth is default + 3 ORDLY15 (DLY3)  */
#define FUSES_FCCFG58_BRINGOSC_0              (FUSES_FCCFG58_BRINGOSC_0_Val << FUSES_FCCFG58_BRINGOSC_Pos) /* (FUSES_FCCFG58) Ring Oscillator depth is default (DLY0) Position */
#define FUSES_FCCFG58_BRINGOSC_1              (FUSES_FCCFG58_BRINGOSC_1_Val << FUSES_FCCFG58_BRINGOSC_Pos) /* (FUSES_FCCFG58) Ring Oscillator depth is default + 1 ORDLY15 (DLY1) Position */
#define FUSES_FCCFG58_BRINGOSC_2              (FUSES_FCCFG58_BRINGOSC_2_Val << FUSES_FCCFG58_BRINGOSC_Pos) /* (FUSES_FCCFG58) Ring Oscillator depth is default + 2 ORDLU15 (DLY2) Position */
#define FUSES_FCCFG58_BRINGOSC_3              (FUSES_FCCFG58_BRINGOSC_3_Val << FUSES_FCCFG58_BRINGOSC_Pos) /* (FUSES_FCCFG58) Ring Oscillator depth is default + 3 ORDLY15 (DLY3) Position */
#define FUSES_FCCFG58_Msk                     _UINT32_(0x00000003)                                 /* (FUSES_FCCFG58) Register Mask  */


/* -------- FUSES_FCCFG59 : (FUSES Offset: 0x16C) ( R/ 32) Calibration Configuration 59 Register -------- */
#define FUSES_FCCFG59_IDAU_EN_Pos             _UINT32_(0)                                          /* (FUSES_FCCFG59) IDAU Enabled Position */
#define FUSES_FCCFG59_IDAU_EN_Msk             (_UINT32_(0x1) << FUSES_FCCFG59_IDAU_EN_Pos)         /* (FUSES_FCCFG59) IDAU Enabled Mask */
#define FUSES_FCCFG59_IDAU_EN(value)          (FUSES_FCCFG59_IDAU_EN_Msk & (_UINT32_(value) << FUSES_FCCFG59_IDAU_EN_Pos)) /* Assignment of value for IDAU_EN in the FUSES_FCCFG59 register */
#define   FUSES_FCCFG59_IDAU_EN_0_Val         _UINT32_(0x0)                                        /* (FUSES_FCCFG59) GC device. All IDAU regions exempt. The boot code will initialize the IDAU, H2PB and PAC as described in Section 2.9.2  */
#define   FUSES_FCCFG59_IDAU_EN_1_Val         _UINT32_(0x1)                                        /* (FUSES_FCCFG59) IDAU regions enabled. The boot code will initialize the IDAU, H2PB and PAC to the values set by customer and referred to in USERCFG as described in Section 2.9.3  */
#define FUSES_FCCFG59_IDAU_EN_0               (FUSES_FCCFG59_IDAU_EN_0_Val << FUSES_FCCFG59_IDAU_EN_Pos) /* (FUSES_FCCFG59) GC device. All IDAU regions exempt. The boot code will initialize the IDAU, H2PB and PAC as described in Section 2.9.2 Position */
#define FUSES_FCCFG59_IDAU_EN_1               (FUSES_FCCFG59_IDAU_EN_1_Val << FUSES_FCCFG59_IDAU_EN_Pos) /* (FUSES_FCCFG59) IDAU regions enabled. The boot code will initialize the IDAU, H2PB and PAC to the values set by customer and referred to in USERCFG as described in Section 2.9.3 Position */
#define FUSES_FCCFG59_Msk                     _UINT32_(0x00000001)                                 /* (FUSES_FCCFG59) Register Mask  */


/* -------- FUSES_FCCFG60 : (FUSES Offset: 0x170) ( R/ 32) Calibration Configuration 60 Register -------- */
#define FUSES_FCCFG60_PUFRAMDNTIME_Pos        _UINT32_(0)                                          /* (FUSES_FCCFG60) PUF RAM Power Down Delay Time Position */
#define FUSES_FCCFG60_PUFRAMDNTIME_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG60_PUFRAMDNTIME_Pos) /* (FUSES_FCCFG60) PUF RAM Power Down Delay Time Mask */
#define FUSES_FCCFG60_PUFRAMDNTIME(value)     (FUSES_FCCFG60_PUFRAMDNTIME_Msk & (_UINT32_(value) << FUSES_FCCFG60_PUFRAMDNTIME_Pos)) /* Assignment of value for PUFRAMDNTIME in the FUSES_FCCFG60 register */
#define FUSES_FCCFG60_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG60) Register Mask  */


/* -------- FUSES_FCCFG61 : (FUSES Offset: 0x174) ( R/ 32) Calibration Configuration 61 Register -------- */
#define FUSES_FCCFG61_PUFRAMUPTIME_Pos        _UINT32_(0)                                          /* (FUSES_FCCFG61) PUF RAM Power Up Delay Time Position */
#define FUSES_FCCFG61_PUFRAMUPTIME_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG61_PUFRAMUPTIME_Pos) /* (FUSES_FCCFG61) PUF RAM Power Up Delay Time Mask */
#define FUSES_FCCFG61_PUFRAMUPTIME(value)     (FUSES_FCCFG61_PUFRAMUPTIME_Msk & (_UINT32_(value) << FUSES_FCCFG61_PUFRAMUPTIME_Pos)) /* Assignment of value for PUFRAMUPTIME in the FUSES_FCCFG61 register */
#define FUSES_FCCFG61_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG61) Register Mask  */


/* -------- FUSES_FCCFG64 : (FUSES Offset: 0x180) ( R/ 32) Calibration Configuration 64 Register -------- */
#define FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM_Pos _UINT32_(0)                                          /* (FUSES_FCCFG64) PTC IBIAS TRIM Position */
#define FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM_Msk (_UINT32_(0x7) << FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM_Pos) /* (FUSES_FCCFG64) PTC IBIAS TRIM Mask */
#define FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM(value) (FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM_Msk & (_UINT32_(value) << FUSES_FCCFG64_PTC_CALIB_PTC_IBIAS_TRIM_Pos)) /* Assignment of value for PTC_CALIB_PTC_IBIAS_TRIM in the FUSES_FCCFG64 register */
#define FUSES_FCCFG64_PTC_CALIB_PTAT_EN_Pos   _UINT32_(3)                                          /* (FUSES_FCCFG64) Enable PTAT current Position */
#define FUSES_FCCFG64_PTC_CALIB_PTAT_EN_Msk   (_UINT32_(0x1) << FUSES_FCCFG64_PTC_CALIB_PTAT_EN_Pos) /* (FUSES_FCCFG64) Enable PTAT current Mask */
#define FUSES_FCCFG64_PTC_CALIB_PTAT_EN(value) (FUSES_FCCFG64_PTC_CALIB_PTAT_EN_Msk & (_UINT32_(value) << FUSES_FCCFG64_PTC_CALIB_PTAT_EN_Pos)) /* Assignment of value for PTC_CALIB_PTAT_EN in the FUSES_FCCFG64 register */
#define FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN_Pos _UINT32_(4)                                          /* (FUSES_FCCFG64) Enable External Bias Position */
#define FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN_Msk (_UINT32_(0x1) << FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN_Pos) /* (FUSES_FCCFG64) Enable External Bias Mask */
#define FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN(value) (FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN_Msk & (_UINT32_(value) << FUSES_FCCFG64_PTC_CALIB_EXT_IBIAS_EN_Pos)) /* Assignment of value for PTC_CALIB_EXT_IBIAS_EN in the FUSES_FCCFG64 register */
#define FUSES_FCCFG64_Msk                     _UINT32_(0x0000001F)                                 /* (FUSES_FCCFG64) Register Mask  */


/* -------- FUSES_FCCFG65 : (FUSES Offset: 0x184) ( R/ 32) Calibration Configuration 65 Register -------- */
#define FUSES_FCCFG65_EN_CMBF_Pos             _UINT32_(0)                                          /* (FUSES_FCCFG65) Enable Common Mode Power Cycling Position */
#define FUSES_FCCFG65_EN_CMBF_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_EN_CMBF_Pos)         /* (FUSES_FCCFG65) Enable Common Mode Power Cycling Mask */
#define FUSES_FCCFG65_EN_CMBF(value)          (FUSES_FCCFG65_EN_CMBF_Msk & (_UINT32_(value) << FUSES_FCCFG65_EN_CMBF_Pos)) /* Assignment of value for EN_CMBF in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_EN_DITHER_Pos           _UINT32_(2)                                          /* (FUSES_FCCFG65) Enable Dithering Position */
#define FUSES_FCCFG65_EN_DITHER_Msk           (_UINT32_(0x1) << FUSES_FCCFG65_EN_DITHER_Pos)       /* (FUSES_FCCFG65) Enable Dithering Mask */
#define FUSES_FCCFG65_EN_DITHER(value)        (FUSES_FCCFG65_EN_DITHER_Msk & (_UINT32_(value) << FUSES_FCCFG65_EN_DITHER_Pos)) /* Assignment of value for EN_DITHER in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_DIS_FAZ_Pos             _UINT32_(3)                                          /* (FUSES_FCCFG65) First Auto Zeroing Position */
#define FUSES_FCCFG65_DIS_FAZ_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_DIS_FAZ_Pos)         /* (FUSES_FCCFG65) First Auto Zeroing Mask */
#define FUSES_FCCFG65_DIS_FAZ(value)          (FUSES_FCCFG65_DIS_FAZ_Msk & (_UINT32_(value) << FUSES_FCCFG65_DIS_FAZ_Pos)) /* Assignment of value for DIS_FAZ in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_DIS_SAZ_Pos             _UINT32_(4)                                          /* (FUSES_FCCFG65) Second Auto Zeroing Position */
#define FUSES_FCCFG65_DIS_SAZ_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_DIS_SAZ_Pos)         /* (FUSES_FCCFG65) Second Auto Zeroing Mask */
#define FUSES_FCCFG65_DIS_SAZ(value)          (FUSES_FCCFG65_DIS_SAZ_Msk & (_UINT32_(value) << FUSES_FCCFG65_DIS_SAZ_Pos)) /* Assignment of value for DIS_SAZ in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_DIS_LAZ_Pos             _UINT32_(5)                                          /* (FUSES_FCCFG65) Current Auto Zeroing Position */
#define FUSES_FCCFG65_DIS_LAZ_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_DIS_LAZ_Pos)         /* (FUSES_FCCFG65) Current Auto Zeroing Mask */
#define FUSES_FCCFG65_DIS_LAZ(value)          (FUSES_FCCFG65_DIS_LAZ_Msk & (_UINT32_(value) << FUSES_FCCFG65_DIS_LAZ_Pos)) /* Assignment of value for DIS_LAZ in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_EN_RDAC_Pos             _UINT32_(6)                                          /* (FUSES_FCCFG65) RDAC Duty Cycle Position */
#define FUSES_FCCFG65_EN_RDAC_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_EN_RDAC_Pos)         /* (FUSES_FCCFG65) RDAC Duty Cycle Mask */
#define FUSES_FCCFG65_EN_RDAC(value)          (FUSES_FCCFG65_EN_RDAC_Msk & (_UINT32_(value) << FUSES_FCCFG65_EN_RDAC_Pos)) /* Assignment of value for EN_RDAC in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_DBG_SEL_Pos             _UINT32_(7)                                          /* (FUSES_FCCFG65) Enable Test Output Position */
#define FUSES_FCCFG65_DBG_SEL_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_DBG_SEL_Pos)         /* (FUSES_FCCFG65) Enable Test Output Mask */
#define FUSES_FCCFG65_DBG_SEL(value)          (FUSES_FCCFG65_DBG_SEL_Msk & (_UINT32_(value) << FUSES_FCCFG65_DBG_SEL_Pos)) /* Assignment of value for DBG_SEL in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_SEL_DEL_Pos             _UINT32_(8)                                          /* (FUSES_FCCFG65) Select Value to comp_out Position */
#define FUSES_FCCFG65_SEL_DEL_Msk             (_UINT32_(0x1) << FUSES_FCCFG65_SEL_DEL_Pos)         /* (FUSES_FCCFG65) Select Value to comp_out Mask */
#define FUSES_FCCFG65_SEL_DEL(value)          (FUSES_FCCFG65_SEL_DEL_Msk & (_UINT32_(value) << FUSES_FCCFG65_SEL_DEL_Pos)) /* Assignment of value for SEL_DEL in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_T1_DELAY_Pos            _UINT32_(9)                                          /* (FUSES_FCCFG65) Programmable delay, selects the delay between regen and latch Position */
#define FUSES_FCCFG65_T1_DELAY_Msk            (_UINT32_(0x3) << FUSES_FCCFG65_T1_DELAY_Pos)        /* (FUSES_FCCFG65) Programmable delay, selects the delay between regen and latch Mask */
#define FUSES_FCCFG65_T1_DELAY(value)         (FUSES_FCCFG65_T1_DELAY_Msk & (_UINT32_(value) << FUSES_FCCFG65_T1_DELAY_Pos)) /* Assignment of value for T1_DELAY in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_TCLK_DIV_Pos            _UINT32_(11)                                         /* (FUSES_FCCFG65) Programmable divider for adc_clk_div. The division ratio is 256, 128, 64,32, and 16 going from MSB to LSB. Position */
#define FUSES_FCCFG65_TCLK_DIV_Msk            (_UINT32_(0x1F) << FUSES_FCCFG65_TCLK_DIV_Pos)       /* (FUSES_FCCFG65) Programmable divider for adc_clk_div. The division ratio is 256, 128, 64,32, and 16 going from MSB to LSB. Mask */
#define FUSES_FCCFG65_TCLK_DIV(value)         (FUSES_FCCFG65_TCLK_DIV_Msk & (_UINT32_(value) << FUSES_FCCFG65_TCLK_DIV_Pos)) /* Assignment of value for TCLK_DIV in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_IADC_1_Pos              _UINT32_(20)                                         /* (FUSES_FCCFG65) Controls the current consumption for of the whole ADC Position */
#define FUSES_FCCFG65_IADC_1_Msk              (_UINT32_(0x3) << FUSES_FCCFG65_IADC_1_Pos)          /* (FUSES_FCCFG65) Controls the current consumption for of the whole ADC Mask */
#define FUSES_FCCFG65_IADC_1(value)           (FUSES_FCCFG65_IADC_1_Msk & (_UINT32_(value) << FUSES_FCCFG65_IADC_1_Pos)) /* Assignment of value for IADC_1 in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_IADC_2_Pos              _UINT32_(22)                                         /* (FUSES_FCCFG65) Controls the current consumption for of the whole ADC. Position */
#define FUSES_FCCFG65_IADC_2_Msk              (_UINT32_(0x3) << FUSES_FCCFG65_IADC_2_Pos)          /* (FUSES_FCCFG65) Controls the current consumption for of the whole ADC. Mask */
#define FUSES_FCCFG65_IADC_2(value)           (FUSES_FCCFG65_IADC_2_Msk & (_UINT32_(value) << FUSES_FCCFG65_IADC_2_Pos)) /* Assignment of value for IADC_2 in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_ICMP_1_Pos              _UINT32_(24)                                         /* (FUSES_FCCFG65) Controls the bias current for 1 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain. Position */
#define FUSES_FCCFG65_ICMP_1_Msk              (_UINT32_(0x3) << FUSES_FCCFG65_ICMP_1_Pos)          /* (FUSES_FCCFG65) Controls the bias current for 1 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain. Mask */
#define FUSES_FCCFG65_ICMP_1(value)           (FUSES_FCCFG65_ICMP_1_Msk & (_UINT32_(value) << FUSES_FCCFG65_ICMP_1_Pos)) /* Assignment of value for ICMP_1 in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_ICMP_2_Pos              _UINT32_(26)                                         /* (FUSES_FCCFG65) Controls the bias current for 2 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain. Position */
#define FUSES_FCCFG65_ICMP_2_Msk              (_UINT32_(0x3) << FUSES_FCCFG65_ICMP_2_Pos)          /* (FUSES_FCCFG65) Controls the bias current for 2 stage of the comparator. This will control the resolution needed by comparator. More current means less time but at expense of gain. Mask */
#define FUSES_FCCFG65_ICMP_2(value)           (FUSES_FCCFG65_ICMP_2_Msk & (_UINT32_(value) << FUSES_FCCFG65_ICMP_2_Pos)) /* Assignment of value for ICMP_2 in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_ICMBF_Pos               _UINT32_(28)                                         /* (FUSES_FCCFG65) Controls the bias current for Common mode buffer amplifier (CMBF) Position */
#define FUSES_FCCFG65_ICMBF_Msk               (_UINT32_(0x3) << FUSES_FCCFG65_ICMBF_Pos)           /* (FUSES_FCCFG65) Controls the bias current for Common mode buffer amplifier (CMBF) Mask */
#define FUSES_FCCFG65_ICMBF(value)            (FUSES_FCCFG65_ICMBF_Msk & (_UINT32_(value) << FUSES_FCCFG65_ICMBF_Pos)) /* Assignment of value for ICMBF in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_EN_ATEST_Pos            _UINT32_(30)                                         /* (FUSES_FCCFG65) Enable analog test signals Position */
#define FUSES_FCCFG65_EN_ATEST_Msk            (_UINT32_(0x1) << FUSES_FCCFG65_EN_ATEST_Pos)        /* (FUSES_FCCFG65) Enable analog test signals Mask */
#define FUSES_FCCFG65_EN_ATEST(value)         (FUSES_FCCFG65_EN_ATEST_Msk & (_UINT32_(value) << FUSES_FCCFG65_EN_ATEST_Pos)) /* Assignment of value for EN_ATEST in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_EN_EXT_BIAS_Pos         _UINT32_(31)                                         /* (FUSES_FCCFG65) Internal switched capacitor bias current allows to make the bias current proportional to conversion frequency. Position */
#define FUSES_FCCFG65_EN_EXT_BIAS_Msk         (_UINT32_(0x1) << FUSES_FCCFG65_EN_EXT_BIAS_Pos)     /* (FUSES_FCCFG65) Internal switched capacitor bias current allows to make the bias current proportional to conversion frequency. Mask */
#define FUSES_FCCFG65_EN_EXT_BIAS(value)      (FUSES_FCCFG65_EN_EXT_BIAS_Msk & (_UINT32_(value) << FUSES_FCCFG65_EN_EXT_BIAS_Pos)) /* Assignment of value for EN_EXT_BIAS in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_Msk                     _UINT32_(0xFFF0FFFD)                                 /* (FUSES_FCCFG65) Register Mask  */


/* -------- FUSES_FCCFG66 : (FUSES Offset: 0x188) ( R/ 32) Calibration Configuration 66 Register -------- */
#define FUSES_FCCFG66_AC_CONFIG_Pos           _UINT32_(0)                                          /* (FUSES_FCCFG66) Comparator 0 Calibration Configuration bits.' Position */
#define FUSES_FCCFG66_AC_CONFIG_Msk           (_UINT32_(0xF) << FUSES_FCCFG66_AC_CONFIG_Pos)       /* (FUSES_FCCFG66) Comparator 0 Calibration Configuration bits.' Mask */
#define FUSES_FCCFG66_AC_CONFIG(value)        (FUSES_FCCFG66_AC_CONFIG_Msk & (_UINT32_(value) << FUSES_FCCFG66_AC_CONFIG_Pos)) /* Assignment of value for AC_CONFIG in the FUSES_FCCFG66 register */
#define FUSES_FCCFG66_Msk                     _UINT32_(0x0000000F)                                 /* (FUSES_FCCFG66) Register Mask  */


/* -------- FUSES_FCCFG68 : (FUSES Offset: 0x190) ( R/ 32) Calibration Configuration 68 Register -------- */
#define FUSES_FCCFG68_TRANSP_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG68) USB PAD P Driver Configuration bits.' Position */
#define FUSES_FCCFG68_TRANSP_Msk              (_UINT32_(0x1F) << FUSES_FCCFG68_TRANSP_Pos)         /* (FUSES_FCCFG68) USB PAD P Driver Configuration bits.' Mask */
#define FUSES_FCCFG68_TRANSP(value)           (FUSES_FCCFG68_TRANSP_Msk & (_UINT32_(value) << FUSES_FCCFG68_TRANSP_Pos)) /* Assignment of value for TRANSP in the FUSES_FCCFG68 register */
#define FUSES_FCCFG68_TRANSN_Pos              _UINT32_(6)                                          /* (FUSES_FCCFG68) USB PAD N Driver Configuration bits.' Position */
#define FUSES_FCCFG68_TRANSN_Msk              (_UINT32_(0x1F) << FUSES_FCCFG68_TRANSN_Pos)         /* (FUSES_FCCFG68) USB PAD N Driver Configuration bits.' Mask */
#define FUSES_FCCFG68_TRANSN(value)           (FUSES_FCCFG68_TRANSN_Msk & (_UINT32_(value) << FUSES_FCCFG68_TRANSN_Pos)) /* Assignment of value for TRANSN in the FUSES_FCCFG68 register */
#define FUSES_FCCFG68_TRIM_Pos                _UINT32_(12)                                         /* (FUSES_FCCFG68) USB PAD Rise/Fall Configuration bits.' Position */
#define FUSES_FCCFG68_TRIM_Msk                (_UINT32_(0x7) << FUSES_FCCFG68_TRIM_Pos)            /* (FUSES_FCCFG68) USB PAD Rise/Fall Configuration bits.' Mask */
#define FUSES_FCCFG68_TRIM(value)             (FUSES_FCCFG68_TRIM_Msk & (_UINT32_(value) << FUSES_FCCFG68_TRIM_Pos)) /* Assignment of value for TRIM in the FUSES_FCCFG68 register */
#define FUSES_FCCFG68_Msk                     _UINT32_(0x000077DF)                                 /* (FUSES_FCCFG68) Register Mask  */


