Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* FUSES register offsets definitions */
#define FUSES_DAL_REG_OFST             _UINT32_(0x00)      /* (FUSES_DAL) DEVICE ACCESS LEVEL Register Offset */
#define FUSES_FRCFGBROM_REG_OFST       _UINT32_(0x400)     /* (FUSES_FRCFGBROM) PRE-BOOT bromc user Options Register Offset */
#define FUSES_FRCFGMBIST_REG_OFST      _UINT32_(0x408)     /* (FUSES_FRCFGMBIST) PRE-BOOT MBIST user Options Register Offset */
#define FUSES_KEYVAL_INTCHK0_REG_OFST  _UINT32_(0x420)     /* (FUSES_KEYVAL_INTCHK0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK1_REG_OFST  _UINT32_(0x424)     /* (FUSES_KEYVAL_INTCHK1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK2_REG_OFST  _UINT32_(0x428)     /* (FUSES_KEYVAL_INTCHK2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK3_REG_OFST  _UINT32_(0x42C)     /* (FUSES_KEYVAL_INTCHK3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK4_REG_OFST  _UINT32_(0x430)     /* (FUSES_KEYVAL_INTCHK4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK5_REG_OFST  _UINT32_(0x434)     /* (FUSES_KEYVAL_INTCHK5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK6_REG_OFST  _UINT32_(0x438)     /* (FUSES_KEYVAL_INTCHK6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_INTCHK7_REG_OFST  _UINT32_(0x43C)     /* (FUSES_KEYVAL_INTCHK7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL0_REG_OFST  _UINT32_(0x440)     /* (FUSES_KEYVAL_CE_ALL0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL1_REG_OFST  _UINT32_(0x444)     /* (FUSES_KEYVAL_CE_ALL1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL2_REG_OFST  _UINT32_(0x448)     /* (FUSES_KEYVAL_CE_ALL2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL3_REG_OFST  _UINT32_(0x44C)     /* (FUSES_KEYVAL_CE_ALL3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL4_REG_OFST  _UINT32_(0x450)     /* (FUSES_KEYVAL_CE_ALL4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL5_REG_OFST  _UINT32_(0x454)     /* (FUSES_KEYVAL_CE_ALL5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL6_REG_OFST  _UINT32_(0x458)     /* (FUSES_KEYVAL_CE_ALL6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_ALL7_REG_OFST  _UINT32_(0x45C)     /* (FUSES_KEYVAL_CE_ALL7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR0_REG_OFST _UINT32_(0x460)     /* (FUSES_KEYVAL_CE_S_CR0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR1_REG_OFST _UINT32_(0x464)     /* (FUSES_KEYVAL_CE_S_CR1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR2_REG_OFST _UINT32_(0x468)     /* (FUSES_KEYVAL_CE_S_CR2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR3_REG_OFST _UINT32_(0x46C)     /* (FUSES_KEYVAL_CE_S_CR3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR4_REG_OFST _UINT32_(0x470)     /* (FUSES_KEYVAL_CE_S_CR4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR5_REG_OFST _UINT32_(0x474)     /* (FUSES_KEYVAL_CE_S_CR5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR6_REG_OFST _UINT32_(0x478)     /* (FUSES_KEYVAL_CE_S_CR6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S_CR7_REG_OFST _UINT32_(0x47C)     /* (FUSES_KEYVAL_CE_S_CR7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S0_REG_OFST    _UINT32_(0x480)     /* (FUSES_KEYVAL_CE_S0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S1_REG_OFST    _UINT32_(0x484)     /* (FUSES_KEYVAL_CE_S1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S2_REG_OFST    _UINT32_(0x488)     /* (FUSES_KEYVAL_CE_S2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S3_REG_OFST    _UINT32_(0x48C)     /* (FUSES_KEYVAL_CE_S3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S4_REG_OFST    _UINT32_(0x490)     /* (FUSES_KEYVAL_CE_S4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S5_REG_OFST    _UINT32_(0x494)     /* (FUSES_KEYVAL_CE_S5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S6_REG_OFST    _UINT32_(0x498)     /* (FUSES_KEYVAL_CE_S6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_S7_REG_OFST    _UINT32_(0x49C)     /* (FUSES_KEYVAL_CE_S7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR0_REG_OFST _UINT32_(0x4A0)     /* (FUSES_KEYVAL_CE_NS_CR0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR1_REG_OFST _UINT32_(0x4A4)     /* (FUSES_KEYVAL_CE_NS_CR1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR2_REG_OFST _UINT32_(0x4A8)     /* (FUSES_KEYVAL_CE_NS_CR2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR3_REG_OFST _UINT32_(0x4AC)     /* (FUSES_KEYVAL_CE_NS_CR3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR4_REG_OFST _UINT32_(0x4B0)     /* (FUSES_KEYVAL_CE_NS_CR4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR5_REG_OFST _UINT32_(0x4B4)     /* (FUSES_KEYVAL_CE_NS_CR5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR6_REG_OFST _UINT32_(0x4B8)     /* (FUSES_KEYVAL_CE_NS_CR6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS_CR7_REG_OFST _UINT32_(0x4BC)     /* (FUSES_KEYVAL_CE_NS_CR7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS0_REG_OFST   _UINT32_(0x4C0)     /* (FUSES_KEYVAL_CE_NS0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS1_REG_OFST   _UINT32_(0x4C4)     /* (FUSES_KEYVAL_CE_NS1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS2_REG_OFST   _UINT32_(0x4C8)     /* (FUSES_KEYVAL_CE_NS2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS3_REG_OFST   _UINT32_(0x4CC)     /* (FUSES_KEYVAL_CE_NS3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS4_REG_OFST   _UINT32_(0x4D0)     /* (FUSES_KEYVAL_CE_NS4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS5_REG_OFST   _UINT32_(0x4D4)     /* (FUSES_KEYVAL_CE_NS5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS6_REG_OFST   _UINT32_(0x4D8)     /* (FUSES_KEYVAL_CE_NS6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_CE_NS7_REG_OFST   _UINT32_(0x4DC)     /* (FUSES_KEYVAL_CE_NS7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG0_REG_OFST  _UINT32_(0x4E0)     /* (FUSES_KEYVAL_PRG_PG0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG1_REG_OFST  _UINT32_(0x4E4)     /* (FUSES_KEYVAL_PRG_PG1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG2_REG_OFST  _UINT32_(0x4E8)     /* (FUSES_KEYVAL_PRG_PG2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG3_REG_OFST  _UINT32_(0x4EC)     /* (FUSES_KEYVAL_PRG_PG3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG4_REG_OFST  _UINT32_(0x4F0)     /* (FUSES_KEYVAL_PRG_PG4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG5_REG_OFST  _UINT32_(0x4F4)     /* (FUSES_KEYVAL_PRG_PG5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG6_REG_OFST  _UINT32_(0x4F8)     /* (FUSES_KEYVAL_PRG_PG6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_PRG_PG7_REG_OFST  _UINT32_(0x4FC)     /* (FUSES_KEYVAL_PRG_PG7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_0_REG_OFST  _UINT32_(0x500)     /* (FUSES_KEYVAL_SDAL1_0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_1_REG_OFST  _UINT32_(0x504)     /* (FUSES_KEYVAL_SDAL1_1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_2_REG_OFST  _UINT32_(0x508)     /* (FUSES_KEYVAL_SDAL1_2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_3_REG_OFST  _UINT32_(0x50C)     /* (FUSES_KEYVAL_SDAL1_3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_4_REG_OFST  _UINT32_(0x510)     /* (FUSES_KEYVAL_SDAL1_4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_5_REG_OFST  _UINT32_(0x514)     /* (FUSES_KEYVAL_SDAL1_5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_6_REG_OFST  _UINT32_(0x518)     /* (FUSES_KEYVAL_SDAL1_6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL1_7_REG_OFST  _UINT32_(0x51C)     /* (FUSES_KEYVAL_SDAL1_7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_0_REG_OFST  _UINT32_(0x520)     /* (FUSES_KEYVAL_SDAL0_0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_1_REG_OFST  _UINT32_(0x524)     /* (FUSES_KEYVAL_SDAL0_1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_2_REG_OFST  _UINT32_(0x528)     /* (FUSES_KEYVAL_SDAL0_2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_3_REG_OFST  _UINT32_(0x52C)     /* (FUSES_KEYVAL_SDAL0_3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_4_REG_OFST  _UINT32_(0x530)     /* (FUSES_KEYVAL_SDAL0_4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_5_REG_OFST  _UINT32_(0x534)     /* (FUSES_KEYVAL_SDAL0_5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_6_REG_OFST  _UINT32_(0x538)     /* (FUSES_KEYVAL_SDAL0_6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_SDAL0_7_REG_OFST  _UINT32_(0x53C)     /* (FUSES_KEYVAL_SDAL0_7) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL0_REG_OFST  _UINT32_(0x540)     /* (FUSES_KEYVAL_DAL_EL0) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL1_REG_OFST  _UINT32_(0x544)     /* (FUSES_KEYVAL_DAL_EL1) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL2_REG_OFST  _UINT32_(0x548)     /* (FUSES_KEYVAL_DAL_EL2) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL3_REG_OFST  _UINT32_(0x54C)     /* (FUSES_KEYVAL_DAL_EL3) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL4_REG_OFST  _UINT32_(0x550)     /* (FUSES_KEYVAL_DAL_EL4) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL5_REG_OFST  _UINT32_(0x554)     /* (FUSES_KEYVAL_DAL_EL5) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL6_REG_OFST  _UINT32_(0x558)     /* (FUSES_KEYVAL_DAL_EL6) Mapped Fuse Register Offset */
#define FUSES_KEYVAL_DAL_EL7_REG_OFST  _UINT32_(0x55C)     /* (FUSES_KEYVAL_DAL_EL7) Mapped Fuse Register Offset */
#define FUSES_PUF_AC_REG_OFST          _UINT32_(0xC00)     /* (FUSES_PUF_AC) Mapped Fuse Register Offset */
#define FUSES_PUF_AC0_REG_OFST         _UINT32_(0xC00)     /* (FUSES_PUF_AC0) Mapped Fuse Register Offset */
#define FUSES_PUF_AC1_REG_OFST         _UINT32_(0xC04)     /* (FUSES_PUF_AC1) Mapped Fuse Register Offset */
#define FUSES_PUF_AC2_REG_OFST         _UINT32_(0xC08)     /* (FUSES_PUF_AC2) Mapped Fuse Register Offset */
#define FUSES_PUF_AC3_REG_OFST         _UINT32_(0xC0C)     /* (FUSES_PUF_AC3) Mapped Fuse Register Offset */
#define FUSES_PUF_AC4_REG_OFST         _UINT32_(0xC10)     /* (FUSES_PUF_AC4) Mapped Fuse Register Offset */
#define FUSES_PUF_AC5_REG_OFST         _UINT32_(0xC14)     /* (FUSES_PUF_AC5) Mapped Fuse Register Offset */
#define FUSES_PUF_AC6_REG_OFST         _UINT32_(0xC18)     /* (FUSES_PUF_AC6) Mapped Fuse Register Offset */
#define FUSES_PUF_AC7_REG_OFST         _UINT32_(0xC1C)     /* (FUSES_PUF_AC7) Mapped Fuse Register Offset */
#define FUSES_PUF_AC8_REG_OFST         _UINT32_(0xC20)     /* (FUSES_PUF_AC8) Mapped Fuse Register Offset */
#define FUSES_PUF_AC9_REG_OFST         _UINT32_(0xC24)     /* (FUSES_PUF_AC9) Mapped Fuse Register Offset */
#define FUSES_PUF_AC10_REG_OFST        _UINT32_(0xC28)     /* (FUSES_PUF_AC10) Mapped Fuse Register Offset */
#define FUSES_PUF_AC11_REG_OFST        _UINT32_(0xC2C)     /* (FUSES_PUF_AC11) Mapped Fuse Register Offset */
#define FUSES_PUF_AC12_REG_OFST        _UINT32_(0xC30)     /* (FUSES_PUF_AC12) Mapped Fuse Register Offset */
#define FUSES_PUF_AC13_REG_OFST        _UINT32_(0xC34)     /* (FUSES_PUF_AC13) Mapped Fuse Register Offset */
#define FUSES_PUF_AC14_REG_OFST        _UINT32_(0xC38)     /* (FUSES_PUF_AC14) Mapped Fuse Register Offset */
#define FUSES_PUF_AC15_REG_OFST        _UINT32_(0xC3C)     /* (FUSES_PUF_AC15) Mapped Fuse Register Offset */
#define FUSES_PUF_AC16_REG_OFST        _UINT32_(0xC40)     /* (FUSES_PUF_AC16) Mapped Fuse Register Offset */
#define FUSES_PUF_AC17_REG_OFST        _UINT32_(0xC44)     /* (FUSES_PUF_AC17) Mapped Fuse Register Offset */
#define FUSES_PUF_AC18_REG_OFST        _UINT32_(0xC48)     /* (FUSES_PUF_AC18) Mapped Fuse Register Offset */
#define FUSES_PUF_AC19_REG_OFST        _UINT32_(0xC4C)     /* (FUSES_PUF_AC19) Mapped Fuse Register Offset */
#define FUSES_PUF_AC20_REG_OFST        _UINT32_(0xC50)     /* (FUSES_PUF_AC20) Mapped Fuse Register Offset */
#define FUSES_PUF_AC21_REG_OFST        _UINT32_(0xC54)     /* (FUSES_PUF_AC21) Mapped Fuse Register Offset */
#define FUSES_PUF_AC22_REG_OFST        _UINT32_(0xC58)     /* (FUSES_PUF_AC22) Mapped Fuse Register Offset */
#define FUSES_PUF_AC23_REG_OFST        _UINT32_(0xC5C)     /* (FUSES_PUF_AC23) Mapped Fuse Register Offset */
#define FUSES_PUF_AC24_REG_OFST        _UINT32_(0xC60)     /* (FUSES_PUF_AC24) Mapped Fuse Register Offset */
#define FUSES_PUF_AC25_REG_OFST        _UINT32_(0xC64)     /* (FUSES_PUF_AC25) Mapped Fuse Register Offset */
#define FUSES_PUF_AC26_REG_OFST        _UINT32_(0xC68)     /* (FUSES_PUF_AC26) Mapped Fuse Register Offset */
#define FUSES_PUF_AC27_REG_OFST        _UINT32_(0xC6C)     /* (FUSES_PUF_AC27) Mapped Fuse Register Offset */
#define FUSES_PUF_AC28_REG_OFST        _UINT32_(0xC70)     /* (FUSES_PUF_AC28) Mapped Fuse Register Offset */
#define FUSES_PUF_AC29_REG_OFST        _UINT32_(0xC74)     /* (FUSES_PUF_AC29) Mapped Fuse Register Offset */
#define FUSES_PUF_AC30_REG_OFST        _UINT32_(0xC78)     /* (FUSES_PUF_AC30) Mapped Fuse Register Offset */
#define FUSES_PUF_AC31_REG_OFST        _UINT32_(0xC7C)     /* (FUSES_PUF_AC31) Mapped Fuse Register Offset */
#define FUSES_PUF_AC32_REG_OFST        _UINT32_(0xC80)     /* (FUSES_PUF_AC32) Mapped Fuse Register Offset */
#define FUSES_PUF_AC33_REG_OFST        _UINT32_(0xC84)     /* (FUSES_PUF_AC33) Mapped Fuse Register Offset */
#define FUSES_PUF_AC34_REG_OFST        _UINT32_(0xC88)     /* (FUSES_PUF_AC34) Mapped Fuse Register Offset */
#define FUSES_PUF_AC35_REG_OFST        _UINT32_(0xC8C)     /* (FUSES_PUF_AC35) Mapped Fuse Register Offset */
#define FUSES_PUF_AC36_REG_OFST        _UINT32_(0xC90)     /* (FUSES_PUF_AC36) Mapped Fuse Register Offset */
#define FUSES_PUF_AC37_REG_OFST        _UINT32_(0xC94)     /* (FUSES_PUF_AC37) Mapped Fuse Register Offset */
#define FUSES_PUF_AC38_REG_OFST        _UINT32_(0xC98)     /* (FUSES_PUF_AC38) Mapped Fuse Register Offset */
#define FUSES_PUF_AC39_REG_OFST        _UINT32_(0xC9C)     /* (FUSES_PUF_AC39) Mapped Fuse Register Offset */
#define FUSES_PUF_AC40_REG_OFST        _UINT32_(0xCA0)     /* (FUSES_PUF_AC40) Mapped Fuse Register Offset */
#define FUSES_PUF_AC41_REG_OFST        _UINT32_(0xCA4)     /* (FUSES_PUF_AC41) Mapped Fuse Register Offset */
#define FUSES_PUF_AC42_REG_OFST        _UINT32_(0xCA8)     /* (FUSES_PUF_AC42) Mapped Fuse Register Offset */
#define FUSES_PUF_AC43_REG_OFST        _UINT32_(0xCAC)     /* (FUSES_PUF_AC43) Mapped Fuse Register Offset */
#define FUSES_PUF_AC44_REG_OFST        _UINT32_(0xCB0)     /* (FUSES_PUF_AC44) Mapped Fuse Register Offset */
#define FUSES_PUF_AC45_REG_OFST        _UINT32_(0xCB4)     /* (FUSES_PUF_AC45) Mapped Fuse Register Offset */
#define FUSES_PUF_AC46_REG_OFST        _UINT32_(0xCB8)     /* (FUSES_PUF_AC46) Mapped Fuse Register Offset */
#define FUSES_PUF_AC47_REG_OFST        _UINT32_(0xCBC)     /* (FUSES_PUF_AC47) Mapped Fuse Register Offset */
#define FUSES_PUF_AC48_REG_OFST        _UINT32_(0xCC0)     /* (FUSES_PUF_AC48) Mapped Fuse Register Offset */
#define FUSES_PUF_AC49_REG_OFST        _UINT32_(0xCC4)     /* (FUSES_PUF_AC49) Mapped Fuse Register Offset */
#define FUSES_PUF_AC50_REG_OFST        _UINT32_(0xCC8)     /* (FUSES_PUF_AC50) Mapped Fuse Register Offset */
#define FUSES_PUF_AC51_REG_OFST        _UINT32_(0xCCC)     /* (FUSES_PUF_AC51) Mapped Fuse Register Offset */
#define FUSES_PUF_AC52_REG_OFST        _UINT32_(0xCD0)     /* (FUSES_PUF_AC52) Mapped Fuse Register Offset */
#define FUSES_PUF_AC53_REG_OFST        _UINT32_(0xCD4)     /* (FUSES_PUF_AC53) Mapped Fuse Register Offset */
#define FUSES_PUF_AC54_REG_OFST        _UINT32_(0xCD8)     /* (FUSES_PUF_AC54) Mapped Fuse Register Offset */
#define FUSES_PUF_AC55_REG_OFST        _UINT32_(0xCDC)     /* (FUSES_PUF_AC55) Mapped Fuse Register Offset */
#define FUSES_PUF_AC56_REG_OFST        _UINT32_(0xCE0)     /* (FUSES_PUF_AC56) Mapped Fuse Register Offset */
#define FUSES_PUF_AC57_REG_OFST        _UINT32_(0xCE4)     /* (FUSES_PUF_AC57) Mapped Fuse Register Offset */
#define FUSES_PUF_AC58_REG_OFST        _UINT32_(0xCE8)     /* (FUSES_PUF_AC58) Mapped Fuse Register Offset */
#define FUSES_PUF_AC59_REG_OFST        _UINT32_(0xCEC)     /* (FUSES_PUF_AC59) Mapped Fuse Register Offset */
#define FUSES_PUF_AC60_REG_OFST        _UINT32_(0xCF0)     /* (FUSES_PUF_AC60) Mapped Fuse Register Offset */
#define FUSES_PUF_AC61_REG_OFST        _UINT32_(0xCF4)     /* (FUSES_PUF_AC61) Mapped Fuse Register Offset */
#define FUSES_PUF_AC62_REG_OFST        _UINT32_(0xCF8)     /* (FUSES_PUF_AC62) Mapped Fuse Register Offset */
#define FUSES_PUF_AC63_REG_OFST        _UINT32_(0xCFC)     /* (FUSES_PUF_AC63) Mapped Fuse Register Offset */
#define FUSES_PUF_AC64_REG_OFST        _UINT32_(0xD00)     /* (FUSES_PUF_AC64) Mapped Fuse Register Offset */
#define FUSES_PUF_AC65_REG_OFST        _UINT32_(0xD04)     /* (FUSES_PUF_AC65) Mapped Fuse Register Offset */
#define FUSES_PUF_AC66_REG_OFST        _UINT32_(0xD08)     /* (FUSES_PUF_AC66) Mapped Fuse Register Offset */
#define FUSES_PUF_AC67_REG_OFST        _UINT32_(0xD0C)     /* (FUSES_PUF_AC67) Mapped Fuse Register Offset */
#define FUSES_PUF_AC68_REG_OFST        _UINT32_(0xD10)     /* (FUSES_PUF_AC68) Mapped Fuse Register Offset */
#define FUSES_PUF_AC69_REG_OFST        _UINT32_(0xD14)     /* (FUSES_PUF_AC69) Mapped Fuse Register Offset */
#define FUSES_PUF_AC70_REG_OFST        _UINT32_(0xD18)     /* (FUSES_PUF_AC70) Mapped Fuse Register Offset */
#define FUSES_PUF_AC71_REG_OFST        _UINT32_(0xD1C)     /* (FUSES_PUF_AC71) Mapped Fuse Register Offset */
#define FUSES_PUF_AC72_REG_OFST        _UINT32_(0xD20)     /* (FUSES_PUF_AC72) Mapped Fuse Register Offset */
#define FUSES_PUF_AC73_REG_OFST        _UINT32_(0xD24)     /* (FUSES_PUF_AC73) Mapped Fuse Register Offset */
#define FUSES_PUF_AC74_REG_OFST        _UINT32_(0xD28)     /* (FUSES_PUF_AC74) Mapped Fuse Register Offset */
#define FUSES_PUF_AC75_REG_OFST        _UINT32_(0xD2C)     /* (FUSES_PUF_AC75) Mapped Fuse Register Offset */
#define FUSES_PUF_AC76_REG_OFST        _UINT32_(0xD30)     /* (FUSES_PUF_AC76) Mapped Fuse Register Offset */
#define FUSES_PUF_AC77_REG_OFST        _UINT32_(0xD34)     /* (FUSES_PUF_AC77) Mapped Fuse Register Offset */
#define FUSES_PUF_AC78_REG_OFST        _UINT32_(0xD38)     /* (FUSES_PUF_AC78) Mapped Fuse Register Offset */
#define FUSES_PUF_AC79_REG_OFST        _UINT32_(0xD3C)     /* (FUSES_PUF_AC79) Mapped Fuse Register Offset */
#define FUSES_PUF_AC80_REG_OFST        _UINT32_(0xD40)     /* (FUSES_PUF_AC80) Mapped Fuse Register Offset */
#define FUSES_PUF_AC81_REG_OFST        _UINT32_(0xD44)     /* (FUSES_PUF_AC81) Mapped Fuse Register Offset */
#define FUSES_PUF_AC82_REG_OFST        _UINT32_(0xD48)     /* (FUSES_PUF_AC82) Mapped Fuse Register Offset */
#define FUSES_PUF_AC83_REG_OFST        _UINT32_(0xD4C)     /* (FUSES_PUF_AC83) Mapped Fuse Register Offset */
#define FUSES_PUF_AC84_REG_OFST        _UINT32_(0xD50)     /* (FUSES_PUF_AC84) Mapped Fuse Register Offset */
#define FUSES_PUF_AC85_REG_OFST        _UINT32_(0xD54)     /* (FUSES_PUF_AC85) Mapped Fuse Register Offset */
#define FUSES_PUF_AC86_REG_OFST        _UINT32_(0xD58)     /* (FUSES_PUF_AC86) Mapped Fuse Register Offset */
#define FUSES_PUF_AC87_REG_OFST        _UINT32_(0xD5C)     /* (FUSES_PUF_AC87) Mapped Fuse Register Offset */
#define FUSES_PUF_AC88_REG_OFST        _UINT32_(0xD60)     /* (FUSES_PUF_AC88) Mapped Fuse Register Offset */
#define FUSES_PUF_AC89_REG_OFST        _UINT32_(0xD64)     /* (FUSES_PUF_AC89) Mapped Fuse Register Offset */
#define FUSES_PUF_AC90_REG_OFST        _UINT32_(0xD68)     /* (FUSES_PUF_AC90) Mapped Fuse Register Offset */
#define FUSES_PUF_AC91_REG_OFST        _UINT32_(0xD6C)     /* (FUSES_PUF_AC91) Mapped Fuse Register Offset */
#define FUSES_PUF_AC92_REG_OFST        _UINT32_(0xD70)     /* (FUSES_PUF_AC92) Mapped Fuse Register Offset */
#define FUSES_PUF_AC93_REG_OFST        _UINT32_(0xD74)     /* (FUSES_PUF_AC93) Mapped Fuse Register Offset */
#define FUSES_PUF_AC94_REG_OFST        _UINT32_(0xD78)     /* (FUSES_PUF_AC94) Mapped Fuse Register Offset */
#define FUSES_PUF_AC95_REG_OFST        _UINT32_(0xD7C)     /* (FUSES_PUF_AC95) Mapped Fuse Register Offset */
#define FUSES_PUF_AC96_REG_OFST        _UINT32_(0xD80)     /* (FUSES_PUF_AC96) Mapped Fuse Register Offset */
#define FUSES_PUF_AC97_REG_OFST        _UINT32_(0xD84)     /* (FUSES_PUF_AC97) Mapped Fuse Register Offset */
#define FUSES_PUF_AC98_REG_OFST        _UINT32_(0xD88)     /* (FUSES_PUF_AC98) Mapped Fuse Register Offset */
#define FUSES_PUF_AC99_REG_OFST        _UINT32_(0xD8C)     /* (FUSES_PUF_AC99) Mapped Fuse Register Offset */
#define FUSES_PUF_AC100_REG_OFST       _UINT32_(0xD90)     /* (FUSES_PUF_AC100) Mapped Fuse Register Offset */
#define FUSES_PUF_AC101_REG_OFST       _UINT32_(0xD94)     /* (FUSES_PUF_AC101) Mapped Fuse Register Offset */
#define FUSES_PUF_AC102_REG_OFST       _UINT32_(0xD98)     /* (FUSES_PUF_AC102) Mapped Fuse Register Offset */
#define FUSES_PUF_AC103_REG_OFST       _UINT32_(0xD9C)     /* (FUSES_PUF_AC103) Mapped Fuse Register Offset */
#define FUSES_PUF_AC104_REG_OFST       _UINT32_(0xDA0)     /* (FUSES_PUF_AC104) Mapped Fuse Register Offset */
#define FUSES_PUF_AC105_REG_OFST       _UINT32_(0xDA4)     /* (FUSES_PUF_AC105) Mapped Fuse Register Offset */
#define FUSES_PUF_AC106_REG_OFST       _UINT32_(0xDA8)     /* (FUSES_PUF_AC106) Mapped Fuse Register Offset */
#define FUSES_PUF_AC107_REG_OFST       _UINT32_(0xDAC)     /* (FUSES_PUF_AC107) Mapped Fuse Register Offset */
#define FUSES_PUF_AC108_REG_OFST       _UINT32_(0xDB0)     /* (FUSES_PUF_AC108) Mapped Fuse Register Offset */
#define FUSES_PUF_AC109_REG_OFST       _UINT32_(0xDB4)     /* (FUSES_PUF_AC109) Mapped Fuse Register Offset */
#define FUSES_PUF_AC110_REG_OFST       _UINT32_(0xDB8)     /* (FUSES_PUF_AC110) Mapped Fuse Register Offset */
#define FUSES_PUF_AC111_REG_OFST       _UINT32_(0xDBC)     /* (FUSES_PUF_AC111) Mapped Fuse Register Offset */
#define FUSES_PUF_AC112_REG_OFST       _UINT32_(0xDC0)     /* (FUSES_PUF_AC112) Mapped Fuse Register Offset */
#define FUSES_PUF_AC113_REG_OFST       _UINT32_(0xDC4)     /* (FUSES_PUF_AC113) Mapped Fuse Register Offset */
#define FUSES_PUF_AC114_REG_OFST       _UINT32_(0xDC8)     /* (FUSES_PUF_AC114) Mapped Fuse Register Offset */
#define FUSES_PUF_AC115_REG_OFST       _UINT32_(0xDCC)     /* (FUSES_PUF_AC115) Mapped Fuse Register Offset */
#define FUSES_PUF_AC116_REG_OFST       _UINT32_(0xDD0)     /* (FUSES_PUF_AC116) Mapped Fuse Register Offset */
#define FUSES_PUF_AC117_REG_OFST       _UINT32_(0xDD4)     /* (FUSES_PUF_AC117) Mapped Fuse Register Offset */
#define FUSES_PUF_AC118_REG_OFST       _UINT32_(0xDD8)     /* (FUSES_PUF_AC118) Mapped Fuse Register Offset */
#define FUSES_PUF_AC119_REG_OFST       _UINT32_(0xDDC)     /* (FUSES_PUF_AC119) Mapped Fuse Register Offset */
#define FUSES_PUF_AC120_REG_OFST       _UINT32_(0xDE0)     /* (FUSES_PUF_AC120) Mapped Fuse Register Offset */
#define FUSES_PUF_AC121_REG_OFST       _UINT32_(0xDE4)     /* (FUSES_PUF_AC121) Mapped Fuse Register Offset */
#define FUSES_PUF_AC122_REG_OFST       _UINT32_(0xDE8)     /* (FUSES_PUF_AC122) Mapped Fuse Register Offset */
#define FUSES_PUF_AC123_REG_OFST       _UINT32_(0xDEC)     /* (FUSES_PUF_AC123) Mapped Fuse Register Offset */
#define FUSES_PUF_AC124_REG_OFST       _UINT32_(0xDF0)     /* (FUSES_PUF_AC124) Mapped Fuse Register Offset */
#define FUSES_PUF_AC125_REG_OFST       _UINT32_(0xDF4)     /* (FUSES_PUF_AC125) Mapped Fuse Register Offset */
#define FUSES_PUF_AC126_REG_OFST       _UINT32_(0xDF8)     /* (FUSES_PUF_AC126) Mapped Fuse Register Offset */
#define FUSES_PUF_AC127_REG_OFST       _UINT32_(0xDFC)     /* (FUSES_PUF_AC127) Mapped Fuse Register Offset */
