Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FUSES_ROMCFG register API structure */
typedef struct
{  /* Defines FUSES module data */
  __IO  uint32_t                       FUSES_DAL;          /* Offset: 0x00 (R/W  32) DEVICE ACCESS LEVEL Register */
  __I   uint8_t                        Reserved1[0x3FC];
  __IO  uint32_t                       FUSES_FRCFGBROM;    /* Offset: 0x400 (R/W  32) PRE-BOOT bromc user Options Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       FUSES_FRCFGMBIST;   /* Offset: 0x408 (R/W  32) PRE-BOOT MBIST user Options Register */
  __I   uint8_t                        Reserved3[0x14];
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK0; /* Offset: 0x420 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK1; /* Offset: 0x424 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK2; /* Offset: 0x428 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK3; /* Offset: 0x42C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK4; /* Offset: 0x430 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK5; /* Offset: 0x434 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK6; /* Offset: 0x438 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_INTCHK7; /* Offset: 0x43C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL0; /* Offset: 0x440 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL1; /* Offset: 0x444 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL2; /* Offset: 0x448 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL3; /* Offset: 0x44C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL4; /* Offset: 0x450 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL5; /* Offset: 0x454 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL6; /* Offset: 0x458 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_ALL7; /* Offset: 0x45C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR0; /* Offset: 0x460 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR1; /* Offset: 0x464 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR2; /* Offset: 0x468 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR3; /* Offset: 0x46C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR4; /* Offset: 0x470 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR5; /* Offset: 0x474 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR6; /* Offset: 0x478 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S_CR7; /* Offset: 0x47C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S0; /* Offset: 0x480 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S1; /* Offset: 0x484 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S2; /* Offset: 0x488 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S3; /* Offset: 0x48C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S4; /* Offset: 0x490 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S5; /* Offset: 0x494 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S6; /* Offset: 0x498 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_S7; /* Offset: 0x49C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR0; /* Offset: 0x4A0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR1; /* Offset: 0x4A4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR2; /* Offset: 0x4A8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR3; /* Offset: 0x4AC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR4; /* Offset: 0x4B0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR5; /* Offset: 0x4B4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR6; /* Offset: 0x4B8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS_CR7; /* Offset: 0x4BC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS0; /* Offset: 0x4C0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS1; /* Offset: 0x4C4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS2; /* Offset: 0x4C8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS3; /* Offset: 0x4CC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS4; /* Offset: 0x4D0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS5; /* Offset: 0x4D4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS6; /* Offset: 0x4D8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_CE_NS7; /* Offset: 0x4DC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG0; /* Offset: 0x4E0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG1; /* Offset: 0x4E4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG2; /* Offset: 0x4E8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG3; /* Offset: 0x4EC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG4; /* Offset: 0x4F0 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG5; /* Offset: 0x4F4 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG6; /* Offset: 0x4F8 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_PRG_PG7; /* Offset: 0x4FC (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_0; /* Offset: 0x500 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_1; /* Offset: 0x504 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_2; /* Offset: 0x508 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_3; /* Offset: 0x50C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_4; /* Offset: 0x510 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_5; /* Offset: 0x514 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_6; /* Offset: 0x518 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL1_7; /* Offset: 0x51C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_0; /* Offset: 0x520 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_1; /* Offset: 0x524 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_2; /* Offset: 0x528 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_3; /* Offset: 0x52C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_4; /* Offset: 0x530 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_5; /* Offset: 0x534 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_6; /* Offset: 0x538 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_SDAL0_7; /* Offset: 0x53C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL0; /* Offset: 0x540 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL1; /* Offset: 0x544 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL2; /* Offset: 0x548 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL3; /* Offset: 0x54C (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL4; /* Offset: 0x550 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL5; /* Offset: 0x554 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL6; /* Offset: 0x558 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_KEYVAL_DAL_EL7; /* Offset: 0x55C (R/W  32) Mapped Fuse Register */
  __I   uint8_t                        Reserved4[0x6A0];
  __IO  uint32_t                       FUSES_PUF_AC[249];  /* Offset: 0xC00 (R/W  32) Mapped Fuse Register */
} fuses_romcfg_registers_t;

/* FUSES_BOOTCFG1 register API structure */
typedef struct
{  /* Defines FUSES module data */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       FUSES_DEVSIGN;      /* Offset: 0x0C (R/W  32) DEVSIGN */
  __I   uint8_t                        Reserved2[0x7F0];
  __IO  uint32_t                       FUSES_BOOT_FLAG;    /* Offset: 0x800 (R/W  32) BOOT CODE FLAGS REGISTER */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       FUSES_DICE_CDI_INDEX; /* Offset: 0x810 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_DICE_FW_HASH_INDEX; /* Offset: 0x814 (R/W  32) Mapped Fuse Register */
  __IO  uint32_t                       FUSES_BOOT_GPIOSEL; /* Offset: 0x818 (R/W  32) BOOT EXTERNAL NOTIFICATION IO PIN REGISTER */
  __IO  uint32_t                       FUSES_H2PB0_NONSECCLRA; /* Offset: 0x81C (R/W  32) Non-Security Clear Register A */
  __IO  uint32_t                       FUSES_H2PB0_NONSECSETA; /* Offset: 0x820 (R/W  32) Non-Security SET Register A */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       FUSES_PAC_WRCTRL_H2PB0; /* Offset: 0x830 (R/W  32) Write Control Register */
  __IO  uint32_t                       FUSES_H2PB1_NONSECCLRA; /* Offset: 0x834 (R/W  32) Non-Security Clear Register A */
  __IO  uint32_t                       FUSES_H2PB1_NONSECSETA; /* Offset: 0x838 (R/W  32) Non-Security SET Register A */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       FUSES_PAC_WRCTRL_H2PB1; /* Offset: 0x848 (R/W  32) Write Control Register */
  __IO  uint32_t                       FUSES_H2PB2_NONSECCLRA; /* Offset: 0x84C (R/W  32) Non-Security Clear Register A */
  __IO  uint32_t                       FUSES_H2PB2_NONSECSETA; /* Offset: 0x850 (R/W  32) Non-Security SET Register A */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       FUSES_PAC_WRCTRL_H2PB2; /* Offset: 0x860 (R/W  32) Write Control Register */
  __IO  uint32_t                       FUSES_IDAU_RCTRL_BFM; /* Offset: 0x864 (R/W  32) Region Control */
  __IO  uint32_t                       FUSES_IDAU_RCTRL_PFMANS; /* Offset: 0x868 (R/W  32) Region Control */
  __IO  uint32_t                       FUSES_IDAU_RCTRL_PFMANSC; /* Offset: 0x86C (R/W  32) Region Control */
  __IO  uint32_t                       FUSES_IDAU_RCTRL_DRM; /* Offset: 0x870 (R/W  32) Region Control */
  __IO  uint32_t                       FUSES_IDAU_CTRL_EN; /* Offset: 0x874 (R/W  32) Control */
  __IO  uint32_t                       FUSES_IDAU_CTRL_WLCK; /* Offset: 0x878 (R/W  32) Control */
  __IO  uint32_t                       FUSES_FCW_CWP;      /* Offset: 0x87C (R/W  32) CFM Page Write Protect REGISTER */
  __IO  uint32_t                       FUSES_FCR_CRP;      /* Offset: 0x880 (R/W  32) CFM Page Read Protection Register */
  __IO  uint32_t                       FUSES_FCR_ECCCTRL;  /* Offset: 0x884 (R/W  32) ECC Control REGISTER */
  __IO  uint32_t                       FUSES_SUPC_BRCFGUSMOR_BOR; /* Offset: 0x888 (R/W  32) Boot Rom Configurable SMOR User CFG BOR register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       FUSES_SUPC_BRCFGUDSSMOR; /* Offset: 0x890 (R/W  32) Boot Rom Configurable DSSMOR User CFG register */
  __IO  uint32_t                       FUSES_SUPC_BRCFGUCP0; /* Offset: 0x894 (R/W  32) Boot Rom Configurable CHARGE PUMP User CFG register */
  __IO  uint32_t                       FUSES_WDT_SETUP;    /* Offset: 0x898 (R/W  32)  */
} fuses_bootcfg1_registers_t;

