Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fuses.h
/* FUSES_CALOTP register API structure */
typedef struct
{  /* Defines FUSES module data */
  __I   uint32_t                       FUSES_F1RR;         /* Offset: 0x00 (R/   32) PANEL 0 REDUNDANCY RECORD 1-0 Register */
  __I   uint8_t                        Reserved1[0x7C];
  __I   uint32_t                       FUSES_FCCFG0;       /* Offset: 0x80 (R/   32) Calibration Configuration 0 Register */
  __I   uint32_t                       FUSES_FCCFG1;       /* Offset: 0x84 (R/   32) Calibration Configuration 1 Register */
  __I   uint8_t                        Reserved2[0x18];
  __I   uint32_t                       FUSES_FCCFG8;       /* Offset: 0xA0 (R/   32) Calibration Configuration 8 Register */
  __I   uint8_t                        Reserved3[0x1C];
  __I   uint32_t                       FUSES_FCCFG16;      /* Offset: 0xC0 (R/   32) Calibration Configuration 16 Register */
  __I   uint32_t                       FUSES_FCCFG17;      /* Offset: 0xC4 (R/   32) Calibration Configuration 17 Register */
  __I   uint8_t                        Reserved4[0x18];
  __I   uint32_t                       FUSES_FCCFG24;      /* Offset: 0xE0 (R/   32) Calibration Configuration 24 Register */
  __I   uint8_t                        Reserved5[0x08];
  __I   uint32_t                       FUSES_FCCFG27;      /* Offset: 0xEC (R/   32) Calibration Configuration 27 Register */
  __I   uint32_t                       FUSES_FCCFG28;      /* Offset: 0xF0 (R/   32) Calibration Configuration 28 Register */
  __I   uint32_t                       FUSES_FCCFG29;      /* Offset: 0xF4 (R/   32) Calibration Configuration 29 Register */
  __I   uint8_t                        Reserved6[0x08];
  __I   uint32_t                       FUSES_FCCFG32;      /* Offset: 0x100 (R/   32) DSU Device Configuration 0 Register (DEVID) */
  __I   uint32_t                       FUSES_FCCFG33;      /* Offset: 0x104 (R/   32) DSU Device Configuration 1 Register */
  __I   uint32_t                       FUSES_FCCFG34;      /* Offset: 0x108 (R/   32) DSU Device Configuration 2 Register */
  __I   uint8_t                        Reserved7[0x38];
  __I   uint32_t                       FUSES_FCCFG49;      /* Offset: 0x144 (R/   32) Calibration Configuration 49 Register */
  __I   uint8_t                        Reserved8[0x18];
  __I   uint32_t                       FUSES_FCCFG56;      /* Offset: 0x160 (R/   32) Calibration Configuration 56 Register */
  __I   uint32_t                       FUSES_FCCFG57;      /* Offset: 0x164 (R/   32) Calibration Configuration 57 Register */
  __I   uint32_t                       FUSES_FCCFG58;      /* Offset: 0x168 (R/   32) Calibration Configuration 58 Register */
  __I   uint32_t                       FUSES_FCCFG59;      /* Offset: 0x16C (R/   32) Calibration Configuration 59 Register */
  __I   uint32_t                       FUSES_FCCFG60;      /* Offset: 0x170 (R/   32) Calibration Configuration 60 Register */
  __I   uint32_t                       FUSES_FCCFG61;      /* Offset: 0x174 (R/   32) Calibration Configuration 61 Register */
  __I   uint8_t                        Reserved9[0x08];
  __I   uint32_t                       FUSES_FCCFG64;      /* Offset: 0x180 (R/   32) Calibration Configuration 64 Register */
  __I   uint32_t                       FUSES_FCCFG65;      /* Offset: 0x184 (R/   32) Calibration Configuration 65 Register */
  __I   uint32_t                       FUSES_FCCFG66;      /* Offset: 0x188 (R/   32) Calibration Configuration 66 Register */
  __I   uint8_t                        Reserved10[0x04];
  __I   uint32_t                       FUSES_FCCFG68;      /* Offset: 0x190 (R/   32) Calibration Configuration 68 Register */
} fuses_calotp_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGC00_FUSES_COMPONENT_H_ */
